<?php

//基础反击率
$counter_obbs =  Array('N' => 75, 'P' => 85, 'K' => 85, 'G' => 50, 'C' => 75, 'D' => 0, 'F'=> 95, 'J'=> 50);
//各种攻击方式的射程，射程大者可以反击射程小者，此外射程为0则代表不能反击任何系但也不能被任何系反击
$rangeinfo = Array('N' => 3, 'P' => 3, 'K' => 3, 'G' => 7, 'C' => 5, 'D' => 0, 'F'=> 1, 'J'=> 8); 
//各种攻击方式的基础命中率
$hitrate_obbs = Array('N' => 80, 'P' => 80, 'K' => 75, 'G' => 70, 'C' => 70, 'D' => 60, 'F' => 85, 'J'=> 10);
//$hitrate_obbs = Array('N' => 80, 'P' => 80, 'K' => 80, 'G' => 75, 'C' => 100, 'D' => 60, 'F' => 70);
//各种攻击方式的最高命中率
$hitrate_max_obbs = Array('N' => 90, 'P' => 90, 'K' => 85, 'G' => 95, 'C' => 96, 'D' => 70, 'F' => 96, 'J'=> 98);
//熟练度对命中的影响，每点熟练增加的命中，可以考虑区分武器
$hitrate_r =  Array('N' => 0.025, 'P' => 0.025, 'K' => 0.025, 'G' => 0.05, 'C' => 0.25, 'D' => 0.02, 'F'=> 0.1, 'J'=> 0.2);
//$hitrate_r =  Array('N' => 0.02, 'P' => 0.02, 'K' => 0.02, 'G' => 0.01, 'C' => 0, 'D' => 0.03, 'F'=> 0.05);
//各种攻击方式的伤害变动范围，越少越稳定。
$dmg_fluc = Array('N' => 15, 'P' => 15, 'K' => 40, 'G' => 20, 'C' => 5, 'D' => 25, 'F'=> 10, 'J'=> 10);
//熟练度对伤害的影响，每点熟练度增加的伤害
$skill_dmg = Array('N' => 0.6, 'P' => 0.6, 'K' => 0.65, 'G' => 0.6, 'C' => 0.4, 'D' => 0.75, 'F'=> 0.4, 'J'=>0.7);
//$skill_dmg = Array('N' => 0.5, 'P' => 0.5, 'K' => 0.5, 'G' => 0.6, 'C' => 0.3, 'D' => 0.4, 'F'=> 1.2);
//各攻击方式对应的防御属性
$def_kind = Array(
    'P' => 'P', 'N' => 'P',
    'K' => 'K',
    'G' => 'G', 'J' => 'G', 
    'C' => 'C',
    'D' => 'D',
    'F' => 'F',
);

//天气对攻击力的影响（单位：百分比加算）
$weather_attack_modifier = Array(
    0 => 10,    //'晴天',
    1 => 10,    //'大晴',
    2 => 0,     //'多云',
    3 => -5,    //'小雨',
    4 => -10,   //'暴雨',
    5 => -20,   //'台风',
    6 => -15,   //'雷雨',
    7 => 0,     //'下雪',
    8 => 0,     //'起雾',
    9 => 7,     //'浓雾',
    10 => 20,   //'<span class="yellow">瘴气</span>',
    11 => -7,   //'<span class="red">龙卷风</span>',
    12 => -20,  //'<span class="clan">暴风雪</span>',
    13 => -5,   //'<span class="blue">冰雹</span>',
    14 => -10,  //'<span class="linen">离子暴</span>',
    15 => -10,  //'<span class="green">辐射尘</span>',
    16 => -10,  //'<span class="purple">臭氧洞</span>',
    17 => 10,   //'<span class="gold">极光</span>',
    18 => 5     //'<span class="minirainbow">光玉雨</span>'
);
//天气对防御力的影响（单位：百分比加算）
$weather_defend_modifier = Array(
    0 =>  10,   //'晴天',
    1 =>  30,   //'大晴',
    2 =>  0,    //'多云',
    3 =>  0,    //'小雨',
    4 =>  -3,   //'暴雨',
    5 =>  -15,  //'台风',
    6 =>  -10,  //'雷雨',
    7 =>  0,    //'下雪',
    8 =>  -20,  //'起雾',
    9 =>  -30,  //'浓雾',
    10 => -50,  //'<span class="yellow">瘴气</span>',
    11 => -5,   //'<span class="red">龙卷风</span>',
    12 => -20,  //'<span class="clan">暴风雪</span>',
    13 => -3,   //'<span class="blue">冰雹</span>',
    14 => -20,  //'<span class="linen">离子暴</span>',
    15 => 5,    //'<span class="green">辐射尘</span>',
    16 => -30,  //'<span class="purple">臭氧洞</span>',
    17 => 30,   //'<span class="gold">极光</span>',
    18 => 35    //'<span class="minirainbow">光玉雨</span>'
);
//天气对发现率的影响
$weather_find_r = Array(
    0 =>  10,   //'晴天',
    1 =>  20,   //'大晴',
    2 =>  0,    //'多云',
    3 =>  -2,   //'小雨',
    4 =>  -3,   //'暴雨',
    5 =>  -3,   //'台风',
    6 =>  -5,   //'雷雨',
    7 =>  5,    //'下雪',
    8 =>  -7,   //'起雾',
    9 =>  -8,   //'浓雾',
    10 => 0,    //'<span class="yellow">瘴气</span>',
    11 => -7,   //'<span class="red">龙卷风</span>',
    12 => -8,   //'<span class="clan">暴风雪</span>',
    13 => -5,   //'<span class="blue">冰雹</span>',
    14 => -5,   //'<span class="linen">离子暴</span>',
    15 => -10,  //'<span class="green">辐射尘</span>',
    16 => 0,    //'<span class="purple">臭氧洞</span>',
    17 => 20,   //'<span class="gold">极光</span>',
    18 => 25    //'<span class="minirainbow">光玉雨</span>'
);
//天气对躲避率的影响
$weather_hide_r = Array(
    0 =>  0,    //'晴天',
    1 =>  0,    //'大晴',
    2 =>  0,    //'多云',
    3 =>  0,    //'小雨',
    4 =>  0,    //'暴雨',
    5 =>  0,    //'台风',
    6 =>  0,    //'雷雨',
    7 =>  0,    //'下雪',
    8 =>  0,    //'起雾',
    9 =>  0,    //'浓雾',
    10 => 0,    //'<span class="yellow">瘴气</span>',
    11 => 0,    //'<span class="red">龙卷风</span>',
    12 => 0,    //'<span class="clan">暴风雪</span>',
    13 => 0,    //'<span class="blue">冰雹</span>',
    14 => 0,    //'<span class="linen">离子暴</span>',
    15 => 0,    //'<span class="green">辐射尘</span>',
    16 => 0,    //'<span class="purple">臭氧洞</span>',
    17 => 0,    //'<span class="gold">极光</span>',
    18 => 0     //'<span class="minirainbow">光玉雨</span>'
);
//天气对先制率的影响
$weather_active_r = Array(
    0 =>  10,   //'晴天',
    1 =>  20,   //'大晴',
    2 =>  0,    //'多云',
    3 =>  -5,   //'小雨',
    4 =>  -7,   //'暴雨',
    5 =>  -7,   //'台风',
    6 =>  -8,   //'雷雨',
    7 =>  0,    //'下雪',
    8 =>  -5,   //'起雾',
    9 =>  -7,   //'浓雾',
    10 => -8,   //'<span class="yellow">瘴气</span>',
    11 => -5,   //'<span class="red">龙卷风</span>',
    12 => 0,    //'<span class="clan">暴风雪</span>',
    13 => -5,   //'<span class="blue">冰雹</span>',
    14 => -20,  //'<span class="linen">离子暴</span>',
    15 => -5,   //'<span class="green">辐射尘</span>',
    16 => 0,    //'<span class="purple">臭氧洞</span>',
    17 => 20,   //'<span class="gold">极光</span>',
    18 => 20    //'<span class="minirainbow">光玉雨</span>'
);

//'通常','作战姿态','强袭姿态','探物姿态','偷袭姿态','治疗姿态','✧狂飙姿态✧','哨戒姿态','✧灵子姿态✧'
//姿态对攻击力的影响始终生效（1：只在作出先制攻击时生效）
$pose_attack_active = 0;
//姿态对攻击力的影响（单位：百分比加算）
$pose_attack_modifier = Array(0,100,0,-25,25,-50,50,-777,0);
//姿态对防御力的影响始终生效（1：只在受到先制攻击伤害时生效）
$pose_defend_active = 0;
//姿态对防御力的影响（单位：百分比加算）
$pose_defend_modifier = Array(0,25,0,-25,-50,-50,-466,777,10);
//姿态对遇敌率的影响（遇敌率越低道具发现率越高）
$pose_find_modifier = Array(0,15,20,-20,20,5,80,85,10);
//姿态对躲避率的影响
$pose_hide_modifier = Array(0,-25,-10,-10,10,-25,-80,-40,0);
//姿态对先制率的影响（单位：百分比加算）（计算方式：进攻方姿态先制率-防守方姿态先制率）
$pose_active_modifier = Array(0,0,50,0,25,-5,5,-100,0);
//姿态对反击率的影响（单位：百分比加算）
$pose_counter_modifier = Array(0,0,0,0,0,-100,0,-100,0);

//'通常','','重视防御','重视反击','重视躲避'
//应战策略对攻击力的影响始终生效（1：只在作出反击时生效）
$tactic_attack_active = 0;
//应战策略对攻击力的加成（单位：百分比加算）
$tactic_attack_modifier = Array(0,20,-25,25,-50);
//应战策略对防御力的影响始终生效（1：只在受反击伤害时生效）
$tactic_defend_active = 0;
//应战策略对防御力的加成（单位：百分比加算）
$tactic_defend_modifier = Array(0,-20,50,-25,0);
//应战策略对躲避率的影响
$tactic_hide_modifier = Array(0,0,0,-15,15);
//应战策略对先制率的影响（单位：百分比加算）
$tactic_active_modifier = Array(0,0,0,0,0);
//应战策略对反击率的影响（单位：百分比加算）
$tactic_counter_modifier = Array(0,0,30,0,0);

//场景对攻击力的加成（单位：百分比加算） wtf
$pls_attack_modifier = Array(
    0=>  10,   //'无月之影',     
    1=>  0,    //'端点', 
    2=>  0,    //'RF高校', 
    3=>  -5,   //'雪之镇',     
    4=>  0,    //'索拉利斯', 
    5=>  5,    //'指挥中心', 
    6=>  5,    //'梦幻馆', 
    7=>  -5,   //'清水池',     
    8=>  -5,   //'白穗神社',     
    9=>  5,    //'墓地', 
    10=> 0,    //'麦斯克林', 
    11=> -15,  //'对天使用作战本部',     
    12=> -5,   //'夏之镇',     
    13=> 0,    //'三体星', 
    14=> -10,  //'光坂高校',     
    15=> 0,    //'守矢神社', 
    16=> 0,    //'常磐森林', 
    17=> 5,    //'常磐台中学', 
    18=> -5,   //'秋之镇',     
    19=> -15,  //'精灵中心',     
    20=> -5,   //'春之镇',     
    21=> 0,    //'圣Gradius学园', 
    22=> 0,    //'初始之树', 
    23=> 0,    //'幻想世界', 
    24=> 0,    //'永恒的世界', 
    25=> 0,    //'妖精驿站', 
    26=> 10,   //'键刃墓场',     
    27=> -10,  //'花菱商厦',     
    28=> 5,    //'FARGO前基地', 
    29=> 0,    //'风祭森林', 
    30=> 0,    //'天使队移动格纳库', 
    31=> 0,    //'和田町研究所', 
    32=> -20,  //'SCP研究设施',     
    33=> 0,    //'雏菊之丘', 
    34=> 15    //'英灵殿'     
);
//场景对防御力的加成（单位：百分比加算）
$pls_defend_modifier = Array(
    0=>  0,    //'无月之影',     
    1=>  -10,  //'端点',     
    2=>  0,    //'RF高校', 
    3=>  0,    //'雪之镇',     
    4=>  -10,  //'索拉利斯',     
    5=>  0,    //'指挥中心', 
    6=>  0,    //'梦幻馆', 
    7=>  0,    //'清水池',     
    8=>  0,    //'白穗神社',     
    9=>  0,    //'墓地', 
    10=> -10,  //'麦斯克林',     
    11=> 5,    //'对天使用作战本部',     
    12=> 0,    //'夏之镇',     
    13=> -10,  //'三体星',     
    14=> 0,    //'光坂高校',     
    15=> 0,    //'守矢神社', 
    16=> 5,    //'常磐森林', 
    17=> 0,    //'常磐台中学', 
    18=> 0,    //'秋之镇',     
    19=> 0,    //'精灵中心',     
    20=> 0,    //'春之镇',     
    21=> 0,    //'圣Gradius学园', 
    22=> -10,  //'初始之树',     
    23=> -10,  //'幻想世界',     
    24=> -10,  //'永恒的世界',     
    25=> 0,    //'妖精驿站', 
    26=> 0,    //'键刃墓场',     
    27=> 0,    //'花菱商厦',     
    28=> 5,    //'FARGO前基地', 
    29=> 5,    //'风祭森林', 
    30=> 5,    //'天使队移动格纳库', 
    31=> 0,    //'和田町研究所', 
    32=> 0,    //'SCP研究设施',     
    33=> -5,   //'雏菊之丘',     
    34=> 0     //'英灵殿'     
); 
//场景对遇敌率的修正
$pls_find_modifier = Array(
    0=>  20,   //'无月之影',          
    1=>  0,    //'端点',  
    2=>  0,    //'RF高校',  
    3=>  0,    //'雪之镇',      
    4=>  0,    //'索拉利斯',  
    5=>  0,    //'指挥中心',  
    6=>  0,    //'梦幻馆',  
    7=>  0,    //'清水池',      
    8=>  0,    //'白穗神社',      
    9=>  0,    //'墓地',  
    10=> 0,    //'麦斯克林',  
    11=> 0,    //'对天使用作战本部',      
    12=> 0,    //'夏之镇',      
    13=> 0,    //'三体星',  
    14=> 0,    //'光坂高校',      
    15=> 0,    //'守矢神社',  
    16=> 0,    //'常磐森林',  
    17=> 0,    //'常磐台中学',  
    18=> 0,    //'秋之镇',      
    19=> 0,    //'精灵中心',      
    20=> 0,    //'春之镇',      
    21=> 0,    //'圣Gradius学园',  
    22=> 0,    //'初始之树',  
    23=> 0,    //'幻想世界',  
    24=> 0,    //'永恒的世界',  
    25=> 0,    //'妖精驿站',  
    26=> 0,    //'键刃墓场',      
    27=> 0,    //'花菱商厦',      
    28=> 0,    //'FARGO前基地',  
    29=> 0,    //'风祭森林',  
    30=> 0,    //'天使队移动格纳库',  
    31=> 0,    //'和田町研究所',  
    32=> 10,   //'SCP研究设施',          
    33=> 0,    //'雏菊之丘',  
    34=> 20    //'英灵殿'      
);
//场景对隐蔽率的修正
$pls_hide_modifier = Array(
    0=>  0,    //'无月之影',     
    1=>  0,    //'端点', 
    2=>  5,    //'RF高校', 
    3=>  5,    //'雪之镇',     
    4=>  0,    //'索拉利斯', 
    5=>  0,    //'指挥中心', 
    6=>  0,    //'梦幻馆', 
    7=>  0,    //'清水池',     
    8=>  0,    //'白穗神社',     
    9=>  -10,  //'墓地', 
    10=> 0,    //'麦斯克林', 
    11=> 0,    //'对天使用作战本部',     
    12=> 5,    //'夏之镇',     
    13=> 0,    //'三体星', 
    14=> 10,   //'光坂高校',     
    15=> 0,    //'守矢神社', 
    16=> -10,  //'常磐森林', 
    17=> 5,    //'常磐台中学', 
    18=> 5,    //'秋之镇',     
    19=> 0,    //'精灵中心',     
    20=> 5,    //'春之镇',     
    21=> 5,    //'圣Gradius学园', 
    22=> 0,    //'初始之树', 
    23=> 0,    //'幻想世界', 
    24=> 0,    //'永恒的世界', 
    25=> 0,    //'妖精驿站', 
    26=> 0,    //'键刃墓场',     
    27=> 15,   //'花菱商厦',     
    28=> -10,  //'FARGO前基地', 
    29=> -10,  //'风祭森林', 
    30=> 0,    //'天使队移动格纳库', 
    31=> 0,    //'和田町研究所', 
    32=> -10,  //'SCP研究设施',     
    33=> 0,    //'雏菊之丘', 
    34=> 0     //'英灵殿'     
);
//各种攻击方式可能导致受伤的部位
$infatt = Array('N' => 'bhaf', 'P' => 'bhaf', 'K' =>'bhaf', 'G' =>'bhaf', 'C'=> 'bhaf', 'D' => 'bhaf', 'F'=> 'bhaf', 'J'=> 'bhaf');
//各种攻击方式可能导致受伤的部位
$infatt_rev = Array('N' => Array('b','h','a','f'), 'P' => Array('b','h','a','f'), 'K' => Array('b','h','a','f'), 'G' => Array('b','h','a','f'), 'C'=> Array('b','h','a','f'), 'D' => Array('b','h','a','f'), 'F'=> Array('b','h','a','f'), 'J'=> Array('b','h','a','f'),);
//各种攻击方式的致伤率
$infobbs = Array('N' => 5, 'P' => 15, 'K' => 55, 'G' => 20, 'C' => 10, 'D' => 45, 'F' => 30, 'J'=> 100);
//$infobbs = Array('N' => 5, 'P' => 15, 'K' => 30, 'G' => 30, 'C' => 15, 'D' => 40, 'F' => 30);
//各种攻击方式的武器损伤概率
$wepimprate = Array('N' => -1, 'P' => 12, 'K' => 30, 'G' => -1, 'C' => -1, 'D' => -1, 'F' => -1, 'J'=> -1);
//特殊效果发生的概率，这里指属性，跟武器系别无关
$specialrate = Array('N' => 40, 'n' => 30, 'y' => 30, 'B' => 95 ,'b' => 95);
//属性攻击登录
$ex_attack = Array('p', 'u', 'i', 'd', 'e','w','f','k');
//各属性攻击对应的防御属性
$ex_def_kind = Array(
    'p' => 'q',
    'u' => 'U', 'f' => 'U',
    'i' => 'I', 'k' => 'I',
    'e' => 'E',
    'w' => 'W',
    'd' => 'D',
);
//各种属性攻击的得意武器（ 伤害2倍）
$ex_good_wep = Array('p' => 'K','u' => 'G','i'=> 'C','d' => 'D', 'e' => 'P', 'w' => 'D');
//各种属性攻击的得意社团（致伤命中率+20）
$ex_good_club = Array('p' => 8,'e' => 7);
//各种属性攻击的克制属性
$ex_dmg_def = Array('p' => 'q', 'u' => 'U', 'i'=>'I','d' => 'D','e' => 'E','w'=>'W');
//各种属性攻击的基础伤害
$ex_base_dmg = Array('p' => 15, 'u' => 25, 'i'=> 10, 'd'=> 1,'e' => 15,'w' => 20,'f' => 5,'k' => 5);
//各种属性攻击的最大伤害值，游戏中，属性攻击伤害不会超过这个参数，0则不限制伤害
$ex_max_dmg = Array('p' => 90, 'u' => 120, 'i'=> 80, 'd'=> 0,'e' => 100,'w' => 100,'f' => 0,'k' => 0);
//各种属性攻击的伤害武器参数，越小伤害上升越快
$ex_wep_dmg = Array('p' => 10, 'u' => 5, 'i'=> 12, 'd'=> 2,'e' => 10,'w' => 12,'f' => 4,'k' => 5);
//各种属性攻击的伤害熟练参数，越小伤害上升越快
$ex_skill_dmg = Array('p' => 15, 'u' => 20, 'i'=> 20 ,'d'=> 500,'e' => 20,'w' => 15,'f' => 40,'k' => 30);
//各种属性攻击的伤害浮动范围
$ex_dmg_fluc = Array('p' => 15, 'u' => 30, 'i'=> 10,'d'=> 20,'e' => 5,'w' => 15,'f' => 30,'k' => 10);
//属性攻击导致的异常状态登录
$ex_inf = Array('p' => 'p', 'u' => 'u', 'i'=> 'i','e' => 'e','w' => 'w','f' => 'u','k' => 'i');
//已经进入异常状态对属性攻击伤害的影响
$ex_inf_punish = Array('p' => 2, 'u' => 1, 'i'=> 0.75,'d' => 1,'e' => 1,'w'=>1.5,'f' => 1.5,'k' => 1.5);
//各种属性攻击的初始致异常状态率
$ex_inf_r = Array('p' => 5, 'u' => 10, 'i'=> 5,'e' => 5,'w'=> 5,'f' => 25,'k' => 25);
//各种属性攻击的最高致异常状态率
$ex_max_inf_r = Array('p' => 60, 'u' => 40, 'i'=> 50,'e' => 50,'w'=> 40,'f' => 70,'k' => 80);
//熟练度对致异常状态率的影响
$ex_skill_inf_r = Array('p' => 0.1, 'u' => 0.05, 'i'=> 0.08,'e' => 0.08,'w' => 0.08, 'f' => 0.1, 'k' => 0.1);

//各种受伤状态对战斗攻击力的影响因子
$inf_att_p = Array('a'=> 0.75,'u'=> 0.6);
//各种受伤状态对战斗防御力的影响因子
$inf_def_p = Array('b'=> 0.75,'i'=> 0.9,'w'=>0.75);
//各种受伤状态对战斗命中率的影响因子
$inf_htr_p = Array('h' => 0.75,'i'=> 0.8,'e' => 0.9);
//各种受伤状态对战斗先攻率的影响因子
$inf_active_p = Array('i'=> 0.9,'e' => 0.2,'w'=> 0.8);
//各种受伤状态对战斗反击率的影响因子
$inf_counter_p = Array('i'=> 0.9,'e' => 0.2,'w'=> 0.8);

?>