<?php

	if(!defined('IN_GAME')) exit('Access Denied');

	/********元素大师配置文件********/

	//wo bei global gaofengle, shui neng jiujiu wo...
	//你怎么回事 搞特殊化？
	global $corpse_to_e_lvl_r;

	//过滤选项：
	//不可以被拆解的NPC类型
	$no_type_to_e_list = Array();
	//不可以被拆解的【道具】（关键词匹配）
	$no_itm_to_e_list = Array();
	//不可以被拆解的【道具类别】
	$no_itmk_to_e_list = Array('N','WN','p','fy','ygo');
	//不可以被拆解的【道具属性】
	$no_itmsk_to_e_list = Array('v','^');
	//使用元素合成的道具自带灵魂绑定属性（启用：1）
	$no_emix_circulation = 0;
	//是否启用研究模式（启用：1）
	//TODO：研究模式：每局游戏初始化时，为元素随机分配不同的特征，为特征组合分配随机配方。
	//玩家需要通过阅读提示纸条，或合成出对应的类型/属性，才能了解到元素特征、组合配方，并显示在技能升级页面。
	//$enable_emix_research_mode = 0;

	/********拆解相关配置********/
	//系数：
	//拆解的对象等级与获得元素的数量关系（默认：等级*1） 什么，小兵竟然有30级！？
	$corpse_to_e_lvl_r = 1; 
	//拆解【特定道具】（全词匹配）时 固定会获得的元素、数量
	//应该还有一些拆掉会触发别的事件的道具，这个特事特判吧
	$itm_to_e_fix = Array
	(
		'◆火之碎片' => Array(0=>7,1=>7,2=>7,3=>7,4=>7,5=>7),
		'消音器' => Array(5=>21), //拆消音器固定获得21个夜静静
		'打火机' => Array(1=>113), //拆打火机固定获得113个暖洋洋
		'树叶' => Array(3=>77), //拆树叶获得77个郁萌萌
		'毒药' => Array(5=>21), //拆毒药固定获得21个夜静静
		'电池' => Array(0=>15,4=>17), //拆电池获得15个亮晶晶、7个昼闪闪
		'バカ⑨制冰块' => Array(2=>19,5=>21), //拆这个东西会获得19个冷冰冰……和21个夜静静……
	);
	//拆解【特定道具】（关键词匹配，顺序越靠前优先级越高）时的元素数量修正 
	$itm_to_e_r = Array
	(
		'宝石方块' => 200, //拆宝石方块获得200倍元素
		'方块' => 100, //拆方块获得100倍元素
	);
	//哪些类别的道具能参与到上面的道具名特判里，暂时没用
	$itm_to_e_r_kfliter = Array();
	//拆解【特定类别】时 固定会获得的元素、数量
	//没有特殊标注时，拆解类别对应的元素与元素的主要特征挂钩
	$itmk_to_e_fix = Array();
	//拆解【特定类别】时获得元素数量的修正系数（默认：1倍）（基础的元素数量：效果+耐久/2 *系数 *浮动）
	$itmk_to_e_r = Array
	(
		//拆解陷阱
		'T' => 0.3,
		//拆解复合武器获得的元素数量x2.5
		//(*)现在拆解复合武器 会当成2把武器进行判断
		'WJ' => 1.5,
		//拆解补给品获得的元素数量x0.01
		'H' => 0.01,
		'HH' => 0.01,	
		'HS' => 0.01,	
		'HB' => 0.02,
		'P' => 0.04,	
		//拆解药剂 x10
		'C' => 10,
		//拆解强化药物……这也舍得拆？
		'ME'=> 18,
		'MH'=> 17,
		'M'=> 10,
		'V'=> 3,
		'VV'=> 5,
		//拆解弹药……这也要拆！？
		'GBh' => 5,
		'GBr' => 0.003,
		'GBi' => 0.005,
		'GBe' => 0.005,
		'GB' => 0.004,	
	);
	//拆解【特定属性】时 固定会获得的元素、数量
	//没有特殊标注时，拆解类别对应的元素与元素的次要特征挂钩
	$itmsk_to_e_fix = Array();

	/********合成相关配置********/
	//【特征】：每个元素带有若干个【主要特征】与【次要特征】。
	//【主要特征】：用于决定合成产物的【类别】，合成时【投入份数最多】的元素会显现其主要特征；
	//【次要特征】：用于决定合成产物的【属性】。
	//元素特征预设模板（关闭研究模式的情况下，每局游戏内元素的特征依此模板固定。）
	$temp_etags = Array
	(
		//dom => 主要特征（类别）  sub => 次要特征（属性）  
		//max_d(s)_tags => 仅在研究模式开启的情况下生效，用于限定元素随机生成的标签上限
		0 => Array('dom' => Array('WP','DH'), 'sub' => Array('e','P','E','x'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //亮晶晶
		1 => Array('dom' => Array('WG','HH'), 'sub' => Array('u','G','U','c'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //暖洋洋
		2 => Array('dom' => Array('WC','HS'), 'sub' => Array('i','C','I','H'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //冷冰冰
		3 => Array('dom' => Array('WK','DB'), 'sub' => Array('p','K','q','z'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //郁萌萌
		4 => Array('dom' => Array('WD','DA'), 'sub' => Array('d','D','R','M'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //昼闪闪
		5 => Array('dom' => Array('WF','DF'), 'sub' => Array('w','F','W','S'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //夜静静
	);

	//合成结果-类别：
	//主要特征组合配方：合成时存在多个【主要特征】（投入了多种占比最高、且数量相同的元素），依此表检查是否有特殊变化
	//obbs：满足条件时有obbs%的概率组合，不设置即为100%组合；random：开启研究模式的情况下，随机为此配方生成random个合成条件。
	$emix_dom_mixlist = array
	( 	
		Array('stuff'=>Array('WG','WK'),'result'=>'WGK'), //射+斩=枪刃 
		Array('stuff'=>Array('WC','WF'),'result'=>'WCF'), //投+符=符札
		Array('stuff'=>Array('WC','WP'),'result'=>'WCP'), //投+殴=重物
		Array('stuff'=>Array('WK','WF'),'result'=>'WKF'), //斩+符=灵刃
		Array('stuff'=>Array('WK','WP'),'result'=>'WKP'), //斩+殴=重剑
		Array('stuff'=>Array('WF','WK','DA'),'result'=>'WFK'), //符+斩=魔刃……？等等……？只能再加个DA凑数了
		Array('stuff'=>Array('WD','WG'),'result'=>'WDG'), //爆+射=巨炮
		Array('stuff'=>Array('WD','WF'),'result'=>'WDF'), //爆+符=落魂
		Array('stuff'=>Array('HH','HS'),'result'=>'HB'), //回命+回体=命体回复
		Array('stuff'=>Array('HH','WF'),'result'=>'HM',), //回命+灵=歌魂增加
		Array('stuff'=>Array('HS','WD'),'result'=>'HT'), //回体+爆=歌魂恢复
		Array('stuff'=>Array('WG','WG'),'result'=>'WJ','obbs'=>30,), //射+射=重枪（30%概率）
		//我认为这里应该有一个配方 可以合出有毒补给或者地雷（
	);

	//合成结果-效果与耐久：
	//效果初始上限值（合成出的道具/装备效果不会超过这个值）
	$max_emix_itme_start = 45;
	//每1级能够提升的上限值（有浮动，具体计算方法在get_emix_itme_max()内）
	$max_emix_itme_up = 29;
	//合成时默认的效果/耐久比例（效果*0.55 耐久*(1-0.55)）（等级变高后，合成时可以自己控制这一比例）
	$default_emix_itme_r = 0.55;

	//合成结果-属性：
	//默认（未定义）属性价值：合成时投入的元素份数（减去用来生成效果、耐久的部分后）大于此值才有概率生成对应属性。
	$emix_sub_tags_default_values = 50;
	//属性价值表：不在表内的属性会使用默认的特征价值。
	$emix_sub_tags_values = Array
	(
		//物理攻击：
		'R' => 11, //馄饨伤害
		'N' => 68, //冲击
		'n' => 89, //贯穿
		'r' => 112, //连击
 		//属性攻击：
		'u' => 52, //火焰
		'i' => 34, //冻气
		'w' => 49, //音波
		'e' => 39, //带电
		'p' => 51, //带毒
		'd' => 77, //爆炸
		'f' => 78, //灼焰
		'k' => 79, //冰华
		//物理防御类：14
		'P' => 14,
		'K' => 14,
		'C' => 14,
		'G' => 14,
		'F' => 14,
		'D' => 28, //防爆好！
		'A' => 101, //全系防御
		'B' => 1, //伤害抹消……
		//属性防御类：17
		'U' => 17,
		'E' => 17,
		'I' => 17,
		'W' => 17,
		'q' => 17,
		'a' => 89, //属性防御
		'b' => 1, //属性抹消
		//杂项：
		'M' => 33, //探雷
		'S' => 15, //消音
		'c' => 26, //重击辅助
		'H' => 42, //HP制御
		'h' => 1997, //伤害制御
		//？：
		'j' => 11, //多重
		'J' => 22, //超量素材 //我有一个想法 但是这里写不下了
		'o' => 66, //一发
		'z' => 77, //天然
		'x' => 777, //奇迹
	);
	//属性价值修正（根据道具类别判断）
	$emix_sub_tags_values_fix = Array
	(
		'HH' => Array('z'=>-66,), //补给品生成天然属性所需的价值-66……但是为什么呢？
		'HS' => Array('z'=>-66,),
		'WD' => Array('d'=>-40,), //爆系武器生成爆炸属性需要的价值-40
		'WDG' => Array('d'=>-20,), 
		'WDF' => Array('d'=>-20,), 
	);
	//次要特征组合配方：将次要特征转化为道具属性时，检查是否满足组合条件。
	//两个配方存在重复元素时，排在前面的会优先生成，可能新增条目的时候要注意下顺序……大概？。
	$emix_sub_mixlist = array
	( 	
		Array('stuff'=>Array('e','w','p','c'),'result'=>'n','obbs'=>50), //音+电+毒+重击辅助=贯穿（50%概率）
		Array('stuff'=>Array('x','z','o'),'result'=>'Z','obbs'=>7), //奇迹+天然+一发=菁英
		Array('stuff'=>Array('u','i'),'result'=>'d','obbs'=>50), //火+冻=爆炸
		Array('stuff'=>Array('i','e'),'result'=>'d','obbs'=>50), //冻+电=爆炸
		Array('stuff'=>Array('w','u'),'result'=>'d','obbs'=>50), //音+火=爆炸
		//冴冴来发挥奇思妙想吧
		//还应该有一些合出连击物防属防或者其他乱七八糟属性的配方，头皮好痒，感觉要长脑子了
	);
	//属性组合配方概率修正（根据道具类别判断）
	$emix_sub_mix_obbs_fix = Array
	(
		'WD' => Array('d'=>50,), //爆系武器生成爆炸属性的概率+50
		'WDG' => Array('d'=>25,), 
		'WDF' => Array('d'=>25,), 
	);

	//合成结果-名字：
	//什么！？原来是万智牌！？
	//合成过程中随机产生的东西
	$emix_tips_arr = Array('天然','喜悦','灵感','奇迹','爱','期待','愤怒','悲伤','乐子','苦闷','既视感','疯狂','幸运','ＲＰ','罪业');
	//括在名字外围的符号
	$emix_name_brackets_arr = Array('☆+☆','★+★','〖+〗','【+】','『+』','「+」','《+》','○+○','●+●');
	//修饰前缀，由主元素决定，有多个主元素时随机抽取。主元素组合成功时再抽取通用前缀。
	$emix_name_prefix_arr = Array
	(
		0 => Array('灰白的','雾蒙蒙的','失去颜色的','罕见的','挑染的','浮夸的','有名的','吸引来龙的','不值钱的','黑色布偶熊的','大咧咧的','吃不完的'),//'亮晶晶'
		1 => Array('火热的','温暖的','混沌的','燃烧着的','地雷的','致命的','有引力的','阳炎的','红发的','超可爱的','被余晖染上的','疯狂的','活在记忆里的'),//'暖洋洋'
		2 => Array('无暇的','快速的','冻住的','生人勿近的','猫的','喜欢宅在家里的','流动的','冷静的','浊心的','高洁的','黏在铁上的','被召唤来的'),//'冷冰冰'
		3 => Array('翡翠的','活力的','生命的','爱的','空虚的','有反差的','双马尾的','迷路了的','加了五分糖的','天然呆的','从树上长出来的','落叶归根的'),//'郁萌萌' //什么！？原来不是郁闷的郁！
		4 => Array('晨曦的','闪闪发光的','金发的','高洁的','像齿轮一样的','迈向明日的','初生的','跃动的','环形的','心怀希冀的','金色的','小男孩的'),//'昼闪闪'
		5 => Array('宵暗的','无声的','活死人的','能停止时间的','无眠的','已经困了的','噩梦的','梦见羊的','梦见门之钥的','喝提神饮料的','黑漆漆的'),//'夜静静'
		6 => Array('神秘的','有魔力的','结构复杂的','用AI模拟的','不可名状的','差不多完美的','终局的','烂尾的','打通了的','世界尽头的','第四面的'),//泛用
	);
	//元词缀，随便挑一个非主元素的
	$emix_name_meta_arr = Array
	(
		0 => Array('乱序之','宝石纹','镭射型','镜面纹','藏书之','晶化型','化合型','糖浆制','石纹','杂糅型','透明纹'),//'亮晶晶'
		1 => Array('燃素之','篝火之','黄昏之','晌午型','凤凰型','猩红之','暖石制','强袭型','破坏型','苹果制','血制'),//'暖洋洋'
		2 => Array('迅捷化','鱼纹','操弄之','碎心型','旁观之','路人之','狡黠之','凛风之','北极型','雾之','魔咒制','激流之'),//'冷冰冰'
		3 => Array('生命之','蔷薇纹','根须制','咖啡制','妖精型','吱吱乱叫之','生姜型','拿铁制','叶形纹','癌化','仿制'),//'郁萌萌'
		4 => Array('启示之','神之','王国制','旭日之','英雄之','荣光之','灯笼型','萤火之','神父之','麻将纹','骑士之'),//'昼闪闪'
		5 => Array('怪异化','黑洞之','视界之','牧人羊型','往事之','循环之','吊诡之','小鬼之','刻奇之','五芒星型','爬行化'),//'夜静静'
		6 => Array('空白之','留声型','映像型','回响型','气动型','姐妹之','差分机制','飞艇型','纸制','彩玻璃制','以太制','黄铜制','贤者之'),//拓展1
	);
	//词尾
	$emix_name_tail_arr = Array
	(
		'WK' => Array('剑','刃','斧','戟','锋刃','光剑','匕首','菜刀','牙','骨','燧石','线'),//'锐器'
		'WP' => Array('棒','锤','槌','惃棒','木棒','昆棒','盾','指虎','火箭飞拳','鞭','松果弹抖闪电鞭','气劲','伪器'),//'钝器'
		'WC' => Array('镖','卡牌','球','雪','飞盘','飞弹','弓','矢','青蛙','水滴','钢琴','猫'),//'投掷'
		'WG' => Array('枪','光枪','燧发枪','步枪','炮','浮游炮','激光','掌心雷','弹弓','导弹发射器'),//'远程'
		'WJ' => Array('狙击步枪','反坦克步枪','巨炮','武器阵列','手提箱','连装炮'),//'重枪'
		'WD' => Array('炸弹','地雷','打击','此面向敌','贝蒂','绳','陷坑','抽卡游戏','短视频','胜负欲','这是什么？摸一下'),//'爆炸物'
		'WF' => Array('符','手环','节杖','触','法书','纸人','信徒','精神性','理论','天赋','秘录','蟑螂'),//'灵武'
		//TODO：复合武器
		'D' => Array('物','加护','轨迹','尾巴','鱼鳞','灯笼裤','胖次','朋友','匣子','投影','力场盾','假说','抑制器','弹药包'),//不分类防具
		//TODO：身体、手部、头部、足部防具
		'H' => Array('糊糊','杏仁豆腐','烤鱼面包','章鱼须','乌鸡肉','生海带','幸运饼干','长芽土豆','眼泪','趣味'),//补给
		'0' => Array('怪东西','？？？','竟然是它','■■■','数据削除'),//泛用性词尾
	);

	/********研究模式配置********/
	//元素初始化时可分配的主要特征列表
	//在随机为元素分配特征时，会优先从不同键名内挑选特征。可以通过在不同键名内加入相同的特征，加大其出现的概率。
	$emix_dom_tags = Array
	(
		'att' => Array('WP','WK','WC','WG','WD','WF'),
		'def' => Array('DB','DH','DA','DF'),
		'misc' => Array('HH','HS'),
	);
	//元素初始化时可分配的次要特征列表：
	$emix_sub_tags = Array
	(
		'att' => Array('u','e','i','w','p','d','R'),
		'def' => Array('P','K','C','G','D','F','U','E','I','W','q'),
		'misc' => Array('M','S','o','z','x','c','H','l','g'),
	);

?>
