<?php
if(!defined('IN_GAME')) exit('Access Denied');

//种火福袋 - FS
//✦ЦВЙΨХЩΗЖФ✦

$lesserdata = <<<EOT
◆篝火,🎆H,1,1,,
◆埋火,🎆V,1,1,,
◆永火,🎆O,1,1,,
◆残火,🎆D,1,1,,
◆焰火,A,1,1,,
EOT;

$item = <<<EOT
针线包,Y,100,1,,
磨刀石,Y,100,1,,
◆火之碎片,HB,13337,1,,
银白盒子,ps,1,1,,
游戏王卡包,ygo,1,1,,
EOT;

$constructs = <<<EOT
雨之琴音,WP,1,50,e,
雪之花香,WK,1,50,i,
雾之轮舞,WG,1,50,u,
晴之高唱,WF,1,50,w,
霾之踏步,WC,1,50,p,
云之咆哮,WD,1,50,d,
雹之飞翔,WB,1,50,c,
EOT;

$material = <<<EOT
◆焰火,A,1,1,,
✦烈焰火,A,50,50,H,
★华焰火★,A,200,100,HZ,
☾真焰火☽,A,500,100,HZ,
☼焰火☼,A,3000,3000,HZ,
EOT;

$sundata = <<<EOT
☼篝火·永昼的加护,🎆H,1500,∞,,
☼埋火·无尽的知识,🎆V,1000,∞,,
☼永火·不灭的意志,🎆O,1000,∞,,
☼残火·无畏的观念,🎆D,1000,∞,,
EOT;
?>