<?php
if(!defined('IN_GAME')) exit('Access Denied');

$itmlow = <<<EOT
脸,WP,60,12,,
脸,WK,60,12,,
脸,WG,60,12,,
脸,WC,60,12,,
脸,WD,60,12,,
脸,WF,60,12,,
脸,DB,60,12,,
脸,DH,60,12,,
脸,DA,60,12,,
脸,DF,60,12,,
装有H173的注射器,Y,1,1,,
空白符卡,X,1,1,,
电击器模型,WP,51,35,e,
寻星者模型,WK,51,35,d,
环形激光模型,WG,51,72,uo,
永恒飞刃模型,WC,51,200,r,
电磁脉冲IED模型,WD,51,28,ed,
开海【海水分开之日】弱化版,WF,51,28,i,
EOT;

$itmmedium = <<<EOT
【北斗百裂拳】,WP,200,30,r,
【狂暴凶刃】,WK,200,30,r,
【盖特机炮】,WG,200,30,r,
幻符【杀人玩偶】,WC,200,30,r,
【泰迪熊炸弹】,WD,200,30,dr,
【西方秋霜玉】,WF,200,30,r,
《小黄的草帽》,DH,30,30,,
《小黄的背心》,DB,40,30,G,
《小黄的钓鱼竿》,DA,30,30,,
《小黄的行军靴》,DF,30,30,,
『扭曲力场』,DB,80,25,UI,
『扭曲力场』,DB,80,25,qE,
『扭曲力场』,DB,80,25,WD,
【宇航服】,DB,80,30,Aa,
【蝶古拉的斗篷】,DB,500,1,Bb,
战斗力指示器,DH,76,54,c,
EOT;

$itmhigh = <<<EOT
☆My Little Buster☆,WF,1200,∞,rd,
篝酱的奇迹☆丝带～刃,WK,4200,100,cjN,
究级篝酱加农炮,WG,4800,200,ir,
【霜火协奏曲】的金质模型,WP,1024,256,uNwdr,
雪拉比的时空球,WC,12000,∞,,
【KEY系催泪弹】,WD,3600,5,zd,
黑色夺魂曲,DB,57,77,ZBb,
武器师安雅的奖赏,Y,1,5,,
★一发逆转神话★,TNc,1,1,x,
EOT;

$antimeta = <<<EOT
【诅咒之角】,A,1,1,+,
【衰弱羽翼】,A,1,1,*,
【厄运蹄铁】,A,1,1,-,
EOT;
?>