<?php

/*Game resources*/

//■ 空手武器 ■
$nowep = '拳头';

//■ 无防具 ■
$noarb = '内衣';
//■ 无道具 ■
$noitm = '--';
//■ 无限耐久度 ■
$nosta = '∞';
//■ 无属性 ■
$nospk = '--';
//■ 多种类武器 ■
$mltwk = '泛用兵器';
//■ 多重属性 ■
//$mltspk = '多重属性';


//游戏状态描述
$gstate = Array(0 => '<font color="grey">已结束</font>',10 => '即将开始',20 => '开放激活',30 => '人数已满',40=> '<font color="yellow">连斗中</font>',50=>'<font color="red">死斗中</font>',60=>'<font color="red">紧急状态！</font>');
$gwin = Array(0 => '程序故障', 1 => '全部死亡',2 => '最后幸存',3 => '锁定解除',4 => '无人参加',5 => '核爆全灭',6 => 'GM中止',7=>'幻境解离');
$week = Array('日','一','二','三','四','五','六');
$clubinfo = Array(
	0=>'无',
	1=>'铁拳无敌',
	2=>'见敌必斩',
	3=>'灌篮高手',
	4=>'狙击鹰眼',
	5=>'拆弹专家',
	6=>'宛如疾风',
	7=>'锡安成员',
	8=>'黑衣组织',
	9=>'超能力者',
	10=>'高速成长',
	11=>'富家子弟',
	12=>'全能骑士',
	13=>'根性兄贵',
	14=>'肌肉兄贵',
	15=>'<span class="L5">L5状态</span>',
	16=>'全能骑士',
	17=>'走路萌物',
	18=>'天赋异禀',
	19=>'晶莹剔透',
	20=>'元素大师', #商店购买社团卡
	21=>'灵子梦魇', #暂定名，商店购买社团卡
	22=>'偶像大师', #暂定名，「除错大师」头衔奖励
	98=>'换装迷宫',
	99=>'决死结界'
);
//新游戏开局时会生成的天气：晴天、多云、小雨、暴雨、下雪；
$rswtharr = Array(0,2,3,4,7);
$wthinfo = Array('晴天','大晴','多云','小雨','暴雨','台风','雷雨','下雪','起雾','浓雾','<span class="yellow">瘴气</span>','<span class="red">龙卷风</span>','<span class="clan">暴风雪</span>','<span class="blue">冰雹</span>','<span class="linen">离子暴</span>','<span class="green">辐射尘</span>','<span class="purple">臭氧洞</span>','<span class="gold">极光</span>');
$sexinfo = Array(0=> '未定', 'm' => '男生', 'f' => '女生');
$raceinfo = Array(0=> '人类', 1=> '兽人', 2=> '妖精', 3=> '龙', 4=> '鱼人', 5=> 'ＡＩ');
$hpinfo = Array('并无大碍','伤痕累累','生命危险','已经死亡');
$spinfo = Array('精力充沛','略有疲惫','精疲力尽','已经死亡');
$rageinfo = Array('平静','愤怒','暴怒','已经死亡');
$wepeinfo = Array('不值一提','略有威胁','威力可观','无敌神器');
$poseinfo = Array('通常','作战姿态','强袭姿态','探物姿态','偷袭姿态','治疗姿态','✧狂飙姿态✧');
$tacinfo = Array('通常','','重视防御','重视反击','重视躲避');
$typeinfo = Array(
	0=>'参战者',
	1=>'红杀将军',
	2=>'全息幻象',
	//3=>'各路党派',
	4=>'拟似意识',
	5=>'杏仁豆腐',
	6=>'黑幕',
	7=>'幻影执行官',
	8=>'管理员',
	9=>'红杀菁英（？）',
	10=>'',
	11=>'真职人',
	12=>'未名存在',
	13=>'循环使者',
	14=>'数据碎片',
	15=>'抹杀使徒',
	19=>'参战者', //真红暮·蓝凝用
	20=>'英雄',
	21=>'武神',
	22=>'天神',
	23=>'使徒',
	24=>'巫师',
	88=>'■■',
	89=>'残像回声',
	90=>'各路党派',
	91=>'各路党派',
	92=>'种火',
);
$killmsginfo = Array(
	0=>'',
	1=>'任务完结。',
	2=>'猎杀任务执行中。',
	//3=>'你弱爆了！',
	4=>'………………',
	5=>'记住，轻敌可是会死的。',
	6=>'忘记历史就意味着背叛，背叛就意味着……死亡。',
	7=>'你的实力还远远不及董事长的脚根呢。',
	8=>'死吧。',
	9=>'MISSION COMPLETE',
	10=>'这是我必须做的事，给您添麻烦了……',
	11=>'看看职人的力量！',
	12=>'你要反省的事情还有很多。',
	14=>'死吧。',
	15=>'………………RIP.',
	19=>'我赢了。',
	89=>'系统弹出，正在计算补正值……',
	90=>'你弱爆了！',
	91=>'你弱爆了！',
	92=>'怜悯覆唱……让希望的执念……成为焰火……'
);
$stateinfo = Array
(
	0=>'正常存活',
	1=>'睡眠状态',
	2=>'治疗状态',
	3=>'静养状态',
	5=>'最后幸存',
	6=>'解除禁区',
	10 => '莫名身亡',
	11 => '禁区停留',
	12 => '毒发身亡',
	13 => '意外死亡',
	14 => '入侵失败',
	15 => '黑幕抹杀',
	16 => '黑幕抹杀',
	17 => '遭遇天灾',
	18 => '烧伤不治',
	20 => '玩家杀害',
	21 => '玩家杀害',
	22 => '玩家杀害',
	23 => '玩家杀害',
	24 => '玩家杀害',
	25 => '玩家杀害',
	26 => '误食毒物',
	27 => '误触陷阱',
	28 => '死亡笔记',
	29 => '玩家杀害',
	30 => '误触机关',
	31 => 'L5病发',
	32 => '挂机受罚',
	33 => '天降软妹，无福消受',
	34 => '溶剂作用',
	35 => '救济',
	36 => '惨遭腰斩',
	37 => '身首异处',
	38 => '业火灼烧',
	39 => '武器反噬',
	40 => '以身试法',
	42 => '独自脱离'
);
$lwinfo = Array(
	0 => '',
	1 => '任务执行成功率下降，重新计算成功率。',
	2 => '机体受损过重，任务被迫中止。',
	//3 => '我觉得我还可以抢救一下……',
	4 => Array(
        '■' => '…………还真的是优秀的个体呢……',
        '月宫 亚由' => '怎……怎么会这样？',
        '神尾 观铃' => '怎……怎么会这样？',
        '古河 渚' => '怎……怎么会这样？',
	),
	5 => Array(
		'冴月 麟' => '打得漂亮……',
		'某四面' => ' ♪ Sharing kindness ♪ '
	),
	6 => '不……不准拿走……快还给我……还给我……',
	7 => Array(
		'电击使 御坂 美琴' => '力尽了……我还……不够强大啊……',
		'班主任 坂持 金发' => '记住吧：如果你憎恨一个人，便要为此付出代价。',
		'花之领主 风见 幽香' => '输掉了啊，不过下次死的就是你了哦！'
	),
	8 => '系统出错了吗？',
	9 => 'Mission in jeopardy, Begin ALT_ROUTINE.',
	10 => '……',
	11 => Array(
        'Hank' => '咳，时代变了么……',
        '爱情上甘岭' => '咳，时代变了么……', 
        '221' => '咳，时代变了么……',
        'Erul Tron' => '咳，时代变了么……',
		'亚玛丽欧·维拉蒂安' => '咳，时代变了么……',
		'【77-JACKPOT】' => '是时候换上下一张面孔了……',
		'便当盒' => '启动ALT+F4紧急脱出程序。',
        '霜火协奏曲' => '咳，时代变了么……', 
        '脸骑士-菜包' => '咳，时代变了么……',
		'东方地雷殿' => '啊。。！放开这个地雷！他还年轻！',		
		'別忘了我' => '做得很好，你又更邁進PVE之路的終點了，加油加油！願我的筆記本可以為你帶來幸運。',
	),
	12 => Array(
		'Dark Force幼体' => '我……!',
		'Dark Force' => '请记住，我是由人类的欲望而生的存在，只要人类存在，我也一样会。我们还会再见的，勇敢的人。'
	),
	13 => Array(
		'库特' => '我……我还不能死在这里……还有人在等着我……！',
		'莱卡' => 'Dangerous Situation...Retreat.',
		'卡玛·克莱因' => '干得不错！在新的世界里再会吧，勇敢的挑战者。'
	),
	14 => Array(
		'讲解员 梦美' => '出了故障的，并不是我，而是——',
		'吉祥物 库特' => '我……我还不能死在这里……还有人在等着我……！',
		'风纪委员 静流' => '………………………………！',
		'喧哗少女 叶留佳' => '超級火大！要知道現在小葉子的火氣比海平面還高了啊！',
		'战斗模式 梦美' => '受损超出预期值……放弃武装、脱出。',
		'本气（？） 叶留佳' => '输掉了？这不可能！我的LP难道不是你的80倍么？！',
//		'科学监察 莱卡' => 'Dangerous situation...Escape capsule launched.',
		'守卫者 静流' => '………………………………？！',
	),
	15 => '………………………………抹杀任务中止，脱出。',
	20 => '這就是善有善報嗎？',
	21 => Array(
	    '虚子' => '你做完后，你的心理得到什么样的满足感，你自己清楚！',
		'水月' => '……',
		'北京推倒你' => '看起来快结束了呢。小心不要一时疏忽领便当了哦。',
	    'BorisX' => 'Boris retreating.',
		'Yoshiko-G' => '什么？你敢杀我，小心吃我权限啦！',
		'lemon' => 'Mission failed.',
		'Renamon' => '啊！反正我很没存在感嘛……消失了也无所谓的……吧。',
		'beijuzhu' => '北极猪已逃，搬运９课任务完成。',
		'黑色奪魂曲' => 'THE END.',
		'捂脸姬' => '作为ACFUN大逃杀第一批的玩家，肯定是跟不上现代的脚步了啊。',
	),	
	22 => Array(
		'冴月麟MK-II' => '一场酣畅淋漓的战斗！脱出！',
		'星莲船四面BOSS' => '我～还～会～再～回～来～的～',
	),
	24 => Array(
		'OGAS' => '主……主板融毁。',
		'胶冻' => '唔，加油捏，不要因为疏忽翻车了呀',
		'菌菌子' => '…要画不完了……',
	),
	89 =>'记录设备状态……存档完成！',
	90 => '我觉得我还可以抢救一下……',
	91 => '我觉得我还可以抢救一下……',
	92 => '成为……焰火……',
);
$infinfo = Array('b' => '<span class="red">胸</span>', 'h' => '<span class="red">头</span>', 'a' => '<span class="red">腕</span>', 'f' => '<span class="red">足</span>', 'p' => '<span class="purple">毒</span>', 'u' => '<span class="red">烧</span>', 'i' => '<span class="clan">冻</span>', 'e' => '<span class="yellow">麻</span>','w' => '<span class="grey">乱</span>');
$attinfo = Array('N' => '徒手殴打', 'P' => '殴打','K' => '斩刺', 'G' => '射击', 'C' => '投掷', 'D' => '设置引信伏击', 'F' => '释放灵力攻击', 'J' => '狙击');
$skillinfo = Array('N' => 'wp', 'P' => 'wp', 'K' => 'wk', 'G' => 'wg', 'C' => 'wc', 'D' => 'wd', 'F'=> 'wf', 'J'=> 'wg');
//$rangeinfo = Array('N' => 'S', 'P' => 'S', 'K' => 'S', 'G' => 'M', 'C' => 'M', 'D' => 'L', 'F'=> 'M'); #各种攻击方式的射程，移动到combatcfg.php
$restinfo = Array('通常','睡眠','治疗','静养');
$noiseinfo = Array(
	'G' => '枪声',
	'J'=> '枪声',
	'D' => '爆炸声',
	'F'=>'灵气',
	'缩写歌名'=>'这是一个很长很长的歌名，不过至少需要3个字符才能识别！',
	'abs'=>'这就是最短的歌名的一个例子',
	'Crow Song'=>'Crow Song',
	'Alicemagic'=>'Alicemagic',
	'恋歌'=>'恋歌',
	'鸡肉之歌'=>'鸡肉之歌'
	);
$exdmgname = Array('p' => '毒性攻击', 'u' => '火焰燃烧', 'i'=>'冻气缠绕', 'd'=>'爆炸','e'=>'电击','w'=>'音波攻击','f' => '<span class="yellow">炽热之焰</span>','k' => '<span class="clan">凝结之息</span>');
$exdmginf = Array('h' => '<span class="red">头部受伤</span>', 'b' => '<span class="red">胸部受伤</span>', 'a'=> '<span class="red">腕部受伤</span>', 'f'=> '<span class="red">足部受伤</span>', 'p'=> '<span class="purple">中毒</span>', 'u'=> '<span class="red">烧伤</span>', 'i'=> '<span class="blue">冻结</span>', 'e'=> '<span class="yellow">身体麻痹</span>', 'w'=> '<span class="grey">混乱</span>');
$infwords = Array('h' => '<span class="red">头部受伤</span>', 'b' => '<span class="red">胸部受伤</span>', 'a'=> '<span class="red">腕部受伤</span>', 'f'=> '<span class="red">足部受伤</span>', 'p'=> '<span class="purple">毒发</span>', 'u'=> '<span class="red">烧伤发作</span>', 'i'=> '<span class="blue">冻结影响</span>', 'e'=> '<span class="yellow">身体麻痹</span>', 'w'=> '<span class="grey">混乱</span>');
$chatinfo = Array(0 => '全员', 1 => '队伍', 2 => '剧情', 3 => '遗言', 4 => '公告', 5 => '系统');
$npcchat = Array(
	1 => Array(
		'林无月' => Array(
			0 => '“竟然有能力闯到这里，还以为这次会轻松些呢……看来咱得亲自上阵了。”',
			1 => '“身手不错，不过咱是不会留情的。”',
			2 => '“咱很欣赏你的实力，可不要让咱太失望了。”',
			3 => '“能将咱逼到这个地步……你，有两下子呢。”',
			4 => '“看来咱不能再抱着玩乐的心态了……你，准备好迎接咱的攻击了么？”',
			5 => '“你觉得你的攻击对咱有效果吗？”',
			6 => '“难道你觉得咱会被这样的招式击倒？”',
			7 => '“咱今日真是棋逢对手啊，越来越有意思了呢。”',
			8 => '“咱可没那么容易倒下！”',
			9 => '“呜……这个躯体……咱还是无法自由运用啊……”',
			10 => '“真是的，这个位置的话没法全力反击啊……”',
			11 => '“真是的，竟然在射程之外啊……”',
			12 => '“咱也是生于常磐森林的人啊！”',
			13 => '“你还不懂得运用你的力量，咱为此感到惋惜。”',
			'color' => 'evergreen'
		),
		'红暮' => Array(
			0 => '“红暮转身扛起6个煤气罐： 哦，杀回来了么……不过你也就到此为止了！”',
			1 => '“真可惜，如果不是因为我拿钱做事，我们可能是朋友。”',
			2 => '“好身手，那么轮到我了！”',
			3 => '“对手目标警戒等级提升到『黄』，反击开始。”',
			4 => '“对手目标警戒等级提升到『红』，执行消灭流程。”',
			5 => '“去再训练一百年吧，没准能碰到我。”',
			6 => '“去再训练五十年吧，没准能伤到我。”',
			7 => '“重新判定目标威胁等级中……”',
			8 => '“判定自身伤害程度……任务续行。”',
			9 => '“任务执行成功率下降，重新计算成功率。”',
			10 => '“判定目标在有效射程外，还有点运气啊……”',
			11 => '“判定目标完全在射程外，敢面对面打么？”',
			12 => '“你是不可能让一个没有死的概念的存在感到恐惧的！”',
			13 => '“任务完了。”',
			'color' => 'evergreen'
		)
	),
	5 => Array(
		'冴月 麟' => Array(
			0 => '“哟呼！虚拟幻境哟，我回来了！”',//meet
			1 => '“实际上你看，我其实一直都没离开过。”',//attackfine
			2 => '“那么，来再于这个虚幻空间中高歌一曲吧……”',
			3 => '“意料之中。”',
			4 => '“必要的牺牲。”',
			5 => '“运气不错，但下次呢？”',//defendfine
			6 => '“你得要拿出剪刀剪石头那样的觉悟才行！”',
			7 => '“从我眼中涌出的眼泪将淹没你！”',//defendhurt
			8 => '“从我血管里面涌出的鲜血将刺穿你！”',
			9 => '“呵呵……”',//retreat
			10 => '“来靠近一点吧……”',//can't counterattack
			11 => '“这样可不行呢……”',//out of range
			12 => '“感恩吧！你会给我变成执念的燃料，成为虚拟幻境的地基！”',//critical
			13 => '“打得漂亮。”',	
			'color' => 'yellow'
		),
		'某四面' => Array(
			0 => '“ ♪ My Little Pony, My Little Pony...Ahh, ahh, ahh, ahhh... ♪ ”',//meet
			1 => '“ ♪ (My Little Pony) ♪ ”',//attackfine
			2 => '“ ♪ I used to wonder what friendship could be ♪ ”',
			3 => '“ ♪ (My Little Pony) ♪ ”',
			4 => '“ ♪ Until you all shared its magic with me ♪ ”',
			5 => '“ ♪ Big adventure ♪ ”',//defendfine
			6 => '“ ♪ Tons of fun ♪ ”',
			7 => '“ ♪ A beautiful heart ♪ ”',//defendhurt
			8 => '“ ♪ Faithful and strong ♪ ”',
			9 => '“ ♪ Sharing kindness ♪ ”',//retreat
			10 => '“ ♪ It\'s an easy feat ♪ ”',//can't counterattack
			11 => '“ ♪ And magic makes it all complete ♪ ”',//out of range
			12 => '“ ♪ You have my little ponies ♪ ”',//critical
			13 => '“ ♪ Do you know you\'re all my very best friends? ♪ ”',	
			'color' => 'yellow'
		)
	),
	6 => Array(
		'Acg_Xilin' => Array(
			0 => '“就凭你也想偷走我重要的东西？我不允许。你去死罢。”',
			1 => '“叽叽咕咕（听不懂的自言自语）”',
			2 => '“为了我的收藏我不会善罢甘休！”',
			3 => '“快看我美丽的收藏品……这样的宝贝，怎么能白送给你！？”',
			4 => '“我跟强盗势不两立！”',
			5 => '“你这样的攻击，没关系么？没关系，没问题。”',
			6 => '“哈哈哈哈，你根本不能让我满足！”',
			7 => '“我诅咒你，妄图打砸抢烧的败类！”',
			8 => '“嘎啊！——（听不懂的嚎叫声）”',
			9 => '“不……不准拿走……快还给我……还给……我……”',
			10 => '“运气真差……运气真差……”',
			11 => '“竟打不到……竟打不到……”',
			12 => 'Acg_Xilin露出了古怪的笑容：“尝尝我的奥义吧，这可是我精心收藏的魔法哟！”',
			13 => '“忘记历史就意味着背叛，背叛就意味着……死亡。”',
			'color' => 'yellow'
		)
	),
	7 => Array(
		'电击使 御坂 美琴' => Array(
			0 => '“擅自侵入禁区的你，应该对自己的下场有所觉悟了吧？”',
			1 => '“只要杀死了你，净化网络的计划就离成功更近一步了吧！”',
			2 => '“知道电磁炮吗？接下这一招，然后死去吧！”',
			3 => '“你的能力竟然这么强吗……看来我必须使出全力了！”',
			4 => '“你这样的随意践踏别人的梦想的人……最差劲了！”',
			5 => '“我可是LEVEL 5的超能力者！普通人的攻击怎么会对我起作用？”',
			6 => '“我还以为入侵禁区的会是什么样的强者……竟然只有你这点实力吗？”',
			7 => '“我才不会因为这样的攻击而倒下！”',
			8 => '“我也有我的立场啊！”',
			9 => '“力尽了……我还……不够强大啊……”',
			10 => '“没预料到这种情况……”',
			11 => '“电磁炮50米的射程竟然不够……”',
			12 => '御坂 美琴周身被蓝色电光层层笼罩：“别以为我的能力只能击飞硬币！”',
			13 => '“所以说，你这样的人最差劲了。”',
			'color' => 'clan'
		),
		'班主任 坂持 金发' => Array(
			0 => '“这个世界没有项圈，那只好由老师我亲手实施惩罚了。”',
			1 => '“现在的年轻人都蔑视成年人，应该煞一煞他们的威风。”',
			2 => '“对蔑视法律的学生就应该先发制人。”',
			3 => '“有两下子，但是你不可能次次都那么走运。”',
			4 => '“老师也有老师的苦衷啊……好好地死去吧。”',
			5 => '“你还很精神嘛，这样的势头很好，继续努力吧。”',
			6 => '“想违抗BR法可不是那么容易的。”',
			7 => '“我好像受了很重的伤呢。”',
			8 => '“我也变成无能的成年人了啊。”',
			9 => '“记住吧：如果你憎恨一个人，便要为此付出代价。”',
			10 => '“这样的情况，暂时撤退吧。”',
			11 => '“距离太远了，暂时撤退吧。”',
			12 => '坂持 金发举枪瞄准：“虽然老师干预游戏是违反规则的……”',
			13 => '“记住这个吧，人生是游戏。”',
			'color' => 'yellow'
		),
		'花之领主 风见 幽香' => Array(
			0 => '“于是，还真有胆敢闯进禁区的人啊，我就奉陪到底吧。”',
			1 => '“把妖力当做伪科学而轻视那就太可笑了。”',
			2 => '“我与你之间究竟谁最强呢，就来分个胜负吧。”',
			3 => '“可不要以为我的能力只是让花朵开放那种程度的哦？”',
			4 => '“竟然能逼我使出全力，真是愉快的战斗啊。”',
			5 => '“这种程度的力量，还不够跟我过招呢。”',
			6 => '“这样的伤痛对于妖怪来说根本不算什么呢。”',
			7 => '“杂草大概是最适合你的植物吧？”',
			8 => '“轮到我反击了呢，我会把你的攻击加倍还给你的哦？”',
			9 => '“输掉了啊，不过下次死的就是你了哦！”',
			10 => '“不妙啊，轻敌了，总之先撤退吧。”',
			11 => '“弹幕射程不够啊，总之先撤退吧。”',
			12 => '风见 幽香张开阳伞做出了一个潇洒的转身：“也许你还没见识过魔炮的力量吧？”',
			13 => '“我还没满足呢，可别就这样轻易地死掉了哦。”',
			'color' => 'lime'
		)
	),
	9 => Array(
	'蓝凝' => Array(
			0 => '“TARGET DETECTED，Commencing FIRST STRIKE。”',
			1 => '“TARGET CONFIRMED，MISSION START。”',
			2 => '“Set, ATTACK STANCE。”',
			3 => '“OPPONENT LEVEL C VERIFIED, begin COUNTER ATTACK。”',
			4 => '“OPPONENT LEVEL B VERIFIED, begin RUNE RELEASE。”',
			5 => '“……too slow。”',
			6 => '“……too weak。”',
			7 => '“……RELOADING RUNES。”',
			8 => '“Set，COUNTER STANCE。”',
			9 => '“Mission in jeopardy, Begin ALT_ROUTINE。”',
			10 => '“……Switching target。”',
			11 => '“……target OUT OF RANGE。”',
			12 => '“……………………………………”',
			13 => '“No Remorse。”',
			'color' => 'clan'
		)
	),
	10 => Array(
		
	),
	12 => Array(
		'Dark Force幼体' => Array(
			0 => '“这么快就过来了么？！”',
			1 => '“……？”',
			2 => '“……！”',
			3 => '“……让开。”',
			4 => '“……”',
			5 => '“唔嗯……”',
			6 => '“…………”',
			7 => '“…………！！”',
			8 => '“回避……！”',
			9 => '“我………！”',
			10 => '“预测失败！？”',
			11 => '“……看我不舒服么？”',
			12 => '“……能成功吧……？”',
			13 => '“虽然情感上很对不起，但这是必要的牺牲。”',
			'color' => 'linen'
		),
		'Dark Force' => Array(
			0 => '“你所作的一切都要被偿还。”',
			1 => '“欲望带来破灭。”',
			2 => '“无视你的欲望就不会死你难道还不明白？！”',
			3 => '“开始反击。”',
			4 => '“让你看看我真正的力量！”',
			5 => '“这就是人类的力量么？”',
			6 => '“干的不错啊你。”',
			7 => '“让我看看你的能力吧！”',
			8 => '“无论是这个时空还是另外一个，人类都是一样的生物。”',
			9 => '“请记住，我是由人类的欲望而生的存在，只要人类存在，我也一样会。<br>我们还会再见的，勇敢的人。”',
			10 => '“你打过来了么？”',
			11 => '“武器的射程，还不够吗？”',
			12 => '“……这样设定的话，应该能成功吧……？”',
			13 => '“反对巴特利安的力量都要被毁灭。”',
			'color' => 'linen'
		)
	),
	21 => Array(
		'虚子' => Array(
			0 => '“没人理我了吗？我被无视了吗？”',//meet
			1 => '“原谅我杀人！但是不杀的话,我就不是人了! ”',//attackfine
			2 => '“你们根本就搞不清楚状况！打法根本就是错的！”',
			3 => '“既想说自己是沙包，又在做不是沙包该做的事！这样的事实，又一次说明这些神触们的无药可救！”',
			4 => '“你还能有正常人的意识吗？明知前面是悬崖也要跳！无知！无聊！”',
			5 => '“哈哈！玩家！你牛！但我更牛!  ”',//defendfine
			6 => '“你不懂的话，就不是中国人！”',
			7 => '“这样的伤害还有存在的意义！”',//defendhurt
			8 => '“你们啊！能清醒点儿吗？”',
			9 => '“你做完后，你的心理得到什么样的满足感，你自己清楚！”',//retreat
			10 => '“哎！现在就算听《蜀绣》，我的心情也好不起来！”',//can't counterattack
			11 => '“留下可怜的我独自哀伤，有人同情却无人理解！哎！”',//out of range
			12 => '“水月这个id，老是拿什么必杀技说事，其实是什么都搞不清楚，还一直说！”',//critical
			13 => '“已经被打死了！大快人心啊！”',
			'color' => 'linen'
			),
		'水月' => Array(
		    0 => '“Love your neighbor as yourself.”',//meet
			1 => '“作恶的，必被剪除!”',//attackfine
			2 => '“愚昧人若静默不言，也可算为智慧。闭口不说，也可算为聪明。”',
			3 => '“……”',
			4 => '“……”',
			5 => '“宽恕人的过失，便是自己的荣耀！”',//defendfine
			6 => '“……北斗要讲毛笑话……”',
			7 => '“……唔”',//defendhurt
			8 => '“……”',
			9 => '“……”',//retreat
			10 => '“……”',//can't counterattack
			11 => '“……Avoid godless chatter……”',//out of range
			12 => '“野驴有草岂能叫唤，牛有料，岂能吼叫？！”',//critical
			13 => '“……JOB 38:11”',		
			'color' => 'clan'
			),
		'北京推倒你' => Array(
		    0 => '“虽然我自称是<span class="blue">历史的眼泪</span>。但很可惜，历史这东西是不相信眼泪的。”',//meet
			1 => '“所谓<span class="red">铁拳无敌</span>，那么就一定是用拳头来证明一切的。”',//attackfine
			2 => '“力道不错，那么该我的反击了！”',
			3 => '“不错啊，也许我也应该重新审视审视你了。”',
			4 => '“很久没有遇到过你这种强力的人物了。”',
			5 => '“离开这里吧，这里不是你这种弱者应该呆的地方。”',//defendfine
			6 => '“离开这里吧，你这种弱者只有再去进行训练才能伤害到我啊。”',
			7 => '“很强，很强啊！”',//defendhurt
			8 => '“唔.....看起来身体有些力不从心了呢。”',
			9 => '“看起来快结束了呢。小心不要一时疏忽领便当了哦。”',//retreat
			10 => '“闪避能力很高啊，但是下一招你还能闪过去吗？”',//can't counterattack
			11 => '“用远程武器打游击战术啊！那么小心，不要让我捕捉到你的身影哦。”',//out of range
			12 => '<span class="white">不知从何而来的数据附着在面前那人的拳头上，使其发出了异样的光芒</span>，“如果说之前都是小意思的话，那么就尝试接下这招吧！”',//critical
			13 => '“弱者，就应该去弱者应该呆的地方。”',
			'color' => 'clan'
		),
		'BorisX' => Array(
		    0 => '“It is I, Boris!”',//meet
			1 => '“There is nothing I cannot do!”',//attackfine
			2 => '“This will be easy.”',
			3 => '“Damn traitorous dogs!”',
			4 => '“Eat lead!”',
			5 => '“Fools, you cannot touch me!”',//defendfine
			6 => '“Do not mess with me.”',
			7 => '“We must have reinforcements!”',//defendhurt
			8 => '“It is very bad here, comrade!”',
			9 => '“Boris retreating.”',//retreat
			10 => '“Good luck, comrade.”',//can't counterattack
			11 => '“I am not going out there!”',//out of range
			12 => '天空中突然出现几架米格战机！“Bring on the MIGs!”',//critical
			13 => '“Who is next?”',
			'color' => 'red'
		),
		'Renamon' => Array(
		    0 => '“咦？我为什么在这里呢？”',//meet
			1 => '“虽然不知道为什么可是我会努力打败你的！”',//attackfine
			2 => '“不知道！不知道！我真的不知道为什么可是身体不由自主地动起来了！”',
			3 => '“我的画笔可是有毒的画笔！”',
			4 => '“说真的我真不知道我在干什么呢……”',
			5 => '“不要以为这样子就能让我趴下，我的墨水还是有很多的！”',//defendfine
			6 => '“真希望战斗很快就会结束啊……不过留下来的一定是我。”',
			7 => '“快点！在我还没有发……发……唔飙……之前赶紧逃吧！”',//defendhurt
			8 => '“我还有力气来着……只要再坚持一下……”',
			9 => '“啊！反正我很没存在感嘛……消失了也无所谓的……吧。”',//retreat
			10 => '“稍微一点小失误……抱歉咯。”',//can't counterattack
			11 => '“这个一点都不好！”',//out of range
			12 => '“不！要！强！调！为！什！么！是（ping）（ru）啦！！和（pin）（ru）完全没有关系！”',//critical
			13 => '“看来存在感能＋1了呢……”',
			'color' => 'yellow'
		),
		'beijuzhu' => Array(
			0 => '“我也是ACFUN大逃杀第一批的玩家，和捂脸姬一样都是搬运９课的成员之一，人称「北极猪」。”',
			1 => '“如果你是没有做好准备就来挑战，那样的话我应该可以把你的尸体搬离英灵殿吧。”',
			2 => '“喔？就算你身手很敏捷，也比不上强袭姿态的突袭率吧？”',
			3 => '“只要还没有死，就有希望。”',
			4 => '“稍微等一下，在我死之前...”',
			5 => '“反击姿态预备！开始！”',
			6 => '“不准逃！”',
			7 => '“这是真的被打成猪了啊。”',
			8 => '“只要HP不是0，反击就是有理。”',
			9 => '“北极猪已逃，搬运９课任务完成。”',
			10 => '“竟然如此刚好反击不能。”',
			11 => '“目标太远了，打不到人啊。”',
			12 => '“你在地图上看见的「变砖PSP」，效果只是杏仁豆腐版本，有本事就试试看这个PSP吧！”',
			13 => '“武神当中我最没存在感了，那这回又如何呢？”',
			'color' => 'yellow'
		),
		'黑色奪魂曲' => Array(
			0 => '“你好，我是黑曲，是台灣人，與冴冴共同創作大逃殺劇情，像是「紅暮」「藍凝」。”',
			1 => '“曾經呢，超９武神霸斬是我用來打天下的靈系武器，但是現在的效果完全是「曾經的榮光」了。”',
			2 => '“恩？你問為什麼我的武器這回不是靈系？那種小細節不用太在意。”',
			3 => '“雖然說我以前有很多作品，但是現在我畫的東西最後都揉掉了，因為水平落差太大了啊。”',
			4 => '“這種情況，我大概快封筆了也說不定。”',
			5 => '“而遊戲中以我為命名的防具也是，在這時代也變成「曾經的榮光」了。”',
			6 => '“黑曲在英靈殿的定位...是類似以前真職人「東方地雷殿」吧，吉祥物般的存在。”',
			7 => '“我快要死了嗎...”',
			8 => '“現在這情況，可怕啊。”',
			9 => '“THE END.”',
			10 => '“和我現在的情況一樣，作畫時力不從心了啊。”',
			11 => '“武器射程太近了，但是靈系即使是已經被削的現在，依然不會弱。”',
			12 => '“奧義，超！９！武！神！霸！斬！！！”',
			13 => '“對不起，出手太重了。喂！你快醒醒啊！不會就這樣...死了吧？”',
			'color' => 'yellow'
		),
		'捂脸姬' => Array(
		    0 => '“大家好，我是ACFUN大逃杀第一批的玩家，真要说有什么职位的话，那就是「试玩」。”',//meet
			1 => '“放心，身为最弱武神组的我，有足够防御是绝对可以挡下的。”',//attackfine
			2 => '“我竟然先攻了第二次？有一就有二，无三不成礼吗？”',
			3 => '“被打成这样肯定是要送武神之魂的节奏吧？”',
			4 => '“我真心不知道我怎么可能在玩家有很高的先手率，即使我是偷袭姿态。”',
			5 => '“你是不可能看到这句台词的，你一定是耍老千！”',
			6 => '“你是不可能看到这句台词的，你一定是耍老千！”',
			7 => '“你是不可能看到这句台词的，你一定是耍老千！”',
			8 => '“你是不可能看到这句台词的，你一定是耍老千！”',
			9 => '“作为ACFUN大逃杀第一批的玩家，肯定是跟不上现代的脚步了啊。”',//retreat
			10 => '“你是不可能看到这句台词的，你一定是耍老千！”',//can't counterattack
			11 => '“就因为是爆系又不是强袭姿态才会被一个叫「计划通行」的ID给偷到武神之魂了啊！！”',//out of range
			12 => '“既然你让我先攻了，那就试试看爆系这70%的最高命中率吧！”',//critical
			13 => '“最弱武神组的我，竟然能杀死人了？你弱爆了。”',
			'color' => 'yellow'
		),		
		'Yoshiko-G' => Array(
            0 => '“赌玉？输了会有什么后果吗？”',//meet
            1 => '“闯英灵殿的你，明知有危险也要来吗？不作死就不会死，为什么你就是不明白？”',//attackfine
            2 => '“可别说强袭姿态是流氓，既然认为流氓还要闯英灵殿，这是何等的矛盾！”',
            3 => '“四面写的切糕系统什么的最恶毒了，最终导致切糕通货膨胀以及刷切糕各种情况发生。”',//attackhurt
            4 => '“四面那个偷懒不干活，成天只会打飞机的程序员，必被剪除。”',
            5 => '“伤害制御是很好的，只要武神还留在场上，你的风险就会居高不下！”',//defendfine
            6 => '“攻击就是最好的防御，你以为这样子就能让我躺下？你也太天真了！”',
            7 => '“你现在认输还来得及，回头是岸啊！不然我很肯定你一定会死于各种奇迹原因。”',//defendhurt
            8 => '“只要我还有HP，我就是要让看着你玩脱才过瘾。”',
            9 => '“什么？你敢杀我，小心吃我权限啦！”',//retreat
            10 => '“哼！你以为不能反击是你运气好？”',//can't counterattack
            11 => '“只敢用爆系的你，与其说是小心，不如说是胆小。”',//out of range
            12 => '「守序善良」？那个会想办法讨好玩家的四面已经死了，让你看看什么才是「混乱邪恶」！”',//critical
            13 => '“赌玉的后果，就是被人卸了一条腿，但是我可是有几万条腿呢，哈哈哈！”',//kill
            'color' => 'yellow'
			),
		'lemon' => Array(
		    0 => '“ACDTS Bot beta #1. Moving out.”',//meet
			1 => '“Enemy spotted.”',//attackfine
			2 => '“Engaging.”',
			3 => '“Engaging. Taking casualties.”',
			4 => '“Engaging. Need support.”',
			5 => '“Enemy encountered. Counterattack.”',//defendfine
			6 => '“In cover behind sandbags. Counterattacking.”',
			7 => '“Taking fire. Need assistance.”',//defendhurt
			8 => '“Need backup.”',
			9 => '“Mission failed.”',//retreat
			10 => '“Enemy is in cover. Supressing fire, need assistance.”',//can't counterattack
			11 => '“Enemy out of range.”',//out of range
			12 => '“For the further!”',//critical
			13 => '“Enemy down.”',
			'color' => 'clan'
		),
	),
	22 => Array(
		'冴月麟MK-II' => Array(
			0 => '“决战英灵殿！令人燃烧殆尽的战斗就要开始了！”',
			1 => '“这个世界早已今非昔比，你的战术能跟上时代的步伐吗？”',
			2 => '“探索和战斗的背后含义是什么，你有没有思考过？”',
			3 => '“NPC的血量是玩家的成千上万倍，但是为什么依然倒在玩家剑下？”',
			4 => '“在不久的将来也许咱还会主动出击！”',
			5 => '“呵哈哈，不够，还不够！没有做到一击毙命会增大你的风险！”',
			6 => '“给咱留下LP就意味着翻盘的可能性，简而言之就是夜长梦多！”',
			7 => '“即使高级NPC已处于生命危险，也不意味着你下一次攻击就能得逞！”',
			8 => '“既然你已经走到这里，想必你一定在思考跨过我的尸体之后应该做些什么了！”',
			9 => '“一场酣畅淋漓的战斗！脱出！”',
			10 => '“无法反击的状态，这是指咱暂时处于不利反击的位置。”',
			11 => '“射程不足，因为你正使用射程大于等于投系的武器。”',
			12 => '三色的光芒从冴月麟的全身喷涌而出：“魂！常磐之力！Unlimited Code Works！”',
			13 => '“那么，咱为又一次坑了你道歉。”',
			'color' => 'yellow'
		),
		'星莲船四面BOSS' => Array(
			0 => '“那么，真名解放！下面就是见证奇迹的时刻！”',
			1 => '“此刻我占尽先机，只要先放倒你就可以不受伤害惩罚了。”',
			2 => '“重炮的附加伤害也受防具的影响，有防弹属性就可以减免了。”',
			3 => '“我的内定称号是‘天赋异秉’，作为NPC大约能把伤害提升到无称号的3倍！”',
			4 => '“而冴冴的内定称号是‘换装迷宫’，一定概率可以切换武器，令人防不胜防。”',
			5 => '“主伤害和附加伤害……嗯也许已经到了再次改革的前夜了。”',
			6 => '“幸好NPC还不会踩雷，否则你们一定会让英灵殿铺满大打击。”',
			7 => '“继续攻击的话，也许你的RP会下降哦，它关系到很多细节概率……。”',
			8 => '“开局一步野生阔剑其实是正常现象，总有人得去踩的嘛，比如你？”',
			9 => '“我～还～会～再～回～来～的～”',
			10 => '“重炮死沉死沉的怪不得反击率低，哪个家伙给游戏引入重炮的啊？”',
			11 => '“全游戏射程最远的武器竟然会射程不足？你一定是爆系！”',
			12 => '“那、那个……就这么说吧！冴冴我喜欢你呀！”（按）',
			13 => '“失手了！不知道坑了多少人的切糕？”',
			'color' => 'yellow'
		)
	),
	13 => Array(
		'卡玛·克莱因' => Array(
			0 => '“幸会，勇敢的挑战者。我是循环的使者卡玛。”',
			1 => '“我的回合。”',
			2 => '“携带备用武器是我的原则。”',
			3 => '“你们管这个叫什么来着？快枪手？”',
			4 => '“你们管这个叫什么来着？二刀流？”',
			5 => '“你们管这个叫什么来着？武器炼金术士？”',
			6 => '“你们管这个叫什么来着？秒间十割……什么来的？”',
			7 => '“武器不好用啊，看来得换把更称手的。”',
			8 => '“依然受伤了？这批人似乎还不赖。”',
			9 => '“干得不错！在新的世界里再会吧，勇敢的挑战者。”',
			10 => '“换武器的时间还需要缩短。”',
			11 => '“用远程武器？懦弱。”',
			12 => '“破绽百出啊！你真的打算认真打么？”',
			13 => '“呵……想要与我们一较高下，你还有得练呢。”',
			'color' => 'yellow'
		),
		'库特' => Array(
			0 => '“哇呼，被发现了吗！？”',
			1 => '“瞄准旁边攻击的话，不会致死的吧……？”',
			2 => '“为了试验，我必须加油了！”',
			3 => '“随便攻击别人是不对的！”',
			4 => '“就算是斯特勒鲁卡，这个时候也会bite a man的！”',
			5 => '“已经满身疮痍了，怎么样才能结束呢……”',
			6 => '“这样下去会出事的啊，快住手吧！”',
			7 => '“好疼好疼，出手太重了啦！”',
			8 => '“就算是试验，也太乱来了……”',
			9 => '“我……我还不能死在这里……还有人在等着我……！”',
			10 => '“哇呼——这就attack过来了啊！？”',
			11 => '“武器的射程，还不够吗？”',
			12 => '“……这样设定的话，应该能成功吧……？”',
			13 => '“这是我必须做的事，给您添麻烦了……”',
			'color' => 'linen'
		),
		'莱卡' => Array(
			0 => '“我似乎沉浸在过去的回忆和相似的人的眷恋里了呢。”',
			1 => '“人类总是在自相残杀……你觉得呢？”',
			2 => '“以前那个不愿意开枪的小女孩，早已被暴徒杀死了。”',
			3 => '“You are a good rival. Counterattack.”',
			4 => '“就没思考过，这种冤冤相报的循环，会导致自灭么？”',
			5 => '“曾经……我也像你一样，有着单纯而快乐的生活。”',
			6 => '“可惜有一天，残酷的命运碾碎了我，就像巨大的机器碾碎变形的齿轮一样。”',
			7 => '“当我再次醒来的时候，属于我的世界已经不存在了。”',
			8 => '“那种踽踽独行的滋味，像你这样的人，难道能理解么！？”',
			9 => '“Dangerous Situation...Retreat.”',
			10 => '“突然袭击呢，很快我们会再会的。”',
			11 => '“射程不足？……怎么会发生这种事？”',
			12 => '莱卡的身后，展开了蝙蝠状的翅膀！<br>“就让你，被牢牢锁死在这濒死的幻想世界里吧，一直到世界崩坏的那一刻……”',
			13 => '“无论是这个世界，还是那个世界，都把你永久放逐了呢。”',
			'color' => 'linen'
		)
	),
	15 => Array(
		'【SANMA_TK】' => Array(
			0 => '少女拿起了台词本……<br>“妖精使可能不想对你们下手，但是我不这么想。”',//meet
			1 => '“先收下你的右手！”',//attackfine
			2 => '“试试这个的威力！”',
			3 => '“……你是没办法超过我的速度的！”',
			4 => '“持强凌弱的家伙……千倍奉还！”',
			5 => '“………………？”',//defendfine
			6 => '“你究竟在为何而战？难道也要背上整个世界才能让你明白你的错误么？”',
			7 => '“你确信你是为正确的一方战斗么？还要重复一遍执念造成的错误么？！”',//defendhurt
			8 => '“妖精使这时会怎么说来着……“给我看看大局吧！”不过我觉得你们是看不到了。”',
			9 => '“真是可悲啊……下次让妖精使给一把更好的武器算了。打得不错。”',//retreat
			10 => '“……耍小聪明……”',//can't counterattack
			11 => '“下一次带对器材狙击枪来，对你们不需要任何仁慈。”',//out of range
			12 => '少女的身影从你的面前消失了，正在你不知道如何是好的情况下，你听到你的头顶上传来一声大喝——『别小看人了！』',//critical
			13 => '“妖精使的话是主张击败对手后留一句话是吧，那么……『给我变成光吧！』，这样算数么？”',	
			'color' => 'yellow'
		),
	),
	24 => Array(
		'胶冻' => Array(
			0 => '“你好啊，我是胶冻，dts的攻略作者，同时也是常磬大逃杀在acfun上官方账号的打理者。”',//meet
			1 => '“这就准备进英灵了？准备好防具和双抹了么？”',//attackfine
			2 => '“偷袭和防御是进英灵的必备条件，前者增加先手率，后者增加受击防御。”',
			3 => '“加油，能够闯英灵，说明胜利就在眼前。”',
			4 => '“如果是解离玩家，击破武神后千万不要久留。”',
			5 => '“就在攻击武神之前，最好先确认射程。危险武神的反击有时会致命。”',//defendfine
			6 => '“不考虑死斗再摸歌魂吗？记得时常动一动小号。”',
			7 => '“时刻注意自身状态，确保每走一步都是满血状态。”',//defendhurt
			8 => '“当拿不准该不该进攻的时候，最好撤退。在英灵投机是不可行的。”',
			9 => '“唔，加油捏，不要因为疏忽翻车了呀。”',//retreat
			10 => '“天神是你非爆系万万不可碰的对象，他们的攻击是一击必杀。”',//can't counterattack
			11 => '“喔，是爆系吗，进英灵最稳的系呢。”',//out of range
			12 => '“每一局只会有五个武神，如果发现某个武神不在很正常。四大天王不在……那就偷着乐吧。”',//critical
			13 => '“啊？怎么可能啊？你怎么可能会被胶冻打死？下次要小心啊！”',	
			'color' => 'spitem2'
		),
		'OGAS' => Array(
			0 => '“你知道吗，电脑其实可以有三进制。”',//meet
			1 => '“不要小看了负数的力量口牙！”',//attackfine
			2 => '“主脑的算力不是你能比拟的！”',
			3 => '“也许你应该考虑一下第三种情况。”',
			4 => '“不确定性也是很美丽的。”',
			5 => '“启动防火墙一阶。”',//defendfine
			6 => '“看来你还是太迟钝了。”',
			7 => '“损害评估中…………”',//defendhurt
			8 => '“死手系统，可恶。”',
			9 => '“主……主板融毁。”',//retreat
			10 => '“算力不够吗……”',//can't counterattack
			11 => '“居然是1，我小看你了。”',//out of range
			12 => '三进制，才是计算机的终点啊！',//critical
			13 => '“蝴蝶的翅膀，比你想象的更有力量。”',	
			'color' => 'spitem2'
		),
		'菌菌子' => Array(
			0 => '“干嘛突然靠过来？”',//meet
			1 => '“随便打扰别人是要付出代价的。”',//attackfine
			2 => '“…是我看起来太好欺负了吗？”',
			3 => '“既然如此，那就没办法了。”',
			4 => '“既然如此……我也不想的。”',
			5 => '“只到这个等级吗？”',//defendfine
			6 => '“只到这个程度吗？”',
			7 => '“呃呃……好痛。”',//defendhurt
			8 => '“呜呜……好痛。”',
			9 => '“…要画不完了……”',//retreat
			10 => '“怎么这样！好过分…”',//can't counterattack
			11 => '“怎么耍赖！好过分…”',//out of range
			12 => '“不会有比甲方更难缠的角色存在的！”',//critical
			13 => '“终于结束了。”',	
			'color' => 'spitem2'
		),
	),
	92 => Array(
		'✦覆唱的篝火' => Array(
			0 => '“Щдвц вц щдψ Йжρψцщαт жω Тψωтαвх, Цвμхвхμ вх!”',
			1 => '“Ωтжп хжщдвхμхψцц αхρ лжвρ, В ожёψ иы.”',
			2 => '“В ρжиηщ одαщ вц дαыыψхвхμ, жщдψт щдαх щдψ ωαλщ...”',
			3 => '“Щдαщ В цджийρ хжщ ηψ дψтψ.”',
			4 => '“Цжпψщдвхμ вц αпвцц.”',
			5 => '“Ηищ ρψψы ρжох, В ωψйщ цжйαλψ.”',
			6 => '“Α хαпψ вц ηищ α двцщжтδ, αйтψαρδ μжхψ овщд щдψ овхρ.”',
			7 => '“Λжпψ щж щдвхё жω вщ, В йжжё ρвωωψтψхщ αц оψйй.”',
			8 => '“В овйй ёψψы оαхρψтвхμ.”',
			9 => '“Пδ αттвлαй джйρц α ыитыжцψ, В ёхжо щдαщ пиλд.”',
			10 => '“Хжо, В αп щтαыыψρ вх α йжжы жω щдψ тψωтαвх.”',
			11 => '“Хψлψтψхρвхμ, Хψлψтηψμвххвхμ.”',
			12 => '“Δψщ, В хψψρ щж μж ωжтоαтρ.”',
			13 => '“Αц В цψψп щж ηψ αйжхψ.”',
			'color' => 'yellow'
		),
		'✦爱恋的埋火' => Array(
			0 => '“Щдвц вц щдψ Ηитвψρ Ωйαпψ жω Йжлψ, Цвμхвхμ вх!”',
			1 => '“Оψ ρψщψλщψρ αх αхжпαйδ.”',
			2 => '“Αх ψфвцщψхλψ щдαщ цджийρ хжщ αыыψαт дψтψ вц ρψщψλщψρ.”',
			3 => '“Оψ ожхρψт, вц щдψтψ αхδ ыжццвηвйвщδ жω твцвхμ цжпψжхψ ωтжп ηψδжхρ?”',
			4 => '“Ηψйвψлψ вщ жт хжщ, щдψ ытжжω вц αйтψαρδ дψтψ.”',
			5 => '“Джоψлψт, щдψтψ цψψпц щж ηψ хж пαйвλвжиц вхщψхщ.”',
			6 => '“Вх жщдψт ожтρц, щдψтψ цψψпц щж ηψ пжтψ λжхωицвжх щдαх одαщ ψйцψ.”',
			7 => '“Щдвц вц лψтδ, лψтδ вхщψтψцщвхμ.”',
			8 => '“Тψйαщвлψ ыαтщвψц дαлψ αйцж ηψψх хжщвωвψρ.”',
			9 => '“Оψ овйй ρж одαщ оψ пицщ.”',
			10 => '“Αхρ оψ джыψ щдψ ραδ оψ тαвцψ жит ηйαρψц αμαвхцщ щдψп овйй хψлψт λжпψ.”',
			11 => '“Дαтпйψцц, йвёψ α одвцыψт.”',
			12 => '“Цжпψщдвхμ щдαщ λжийρ ωαρψ овщд щдψ овхρ.”',
			13 => '“Щджцψ ωйαпψц...”',
			'color' => 'yellow'
		),
		'✦怜悯的永火' => Array(
			0 => '“Щдвц вц щдψ Цыαтё жω Λжпыαццвжх, Цвμхвхμ вх!”',
			1 => '“Ωжт цжпψ тψαцжх, оψ ωжихρ житцψйлψц щж ηψ тψщитхψρ.”',
			2 => '“Оψ цджийρ хжщ ψфвцщ, δψщ дψтψ оψ αтψ.”',
			3 => '“Оψ дαρ α ыитыжцψ, ηищ вщ дαц ωαρψρ αоαδ.”',
			4 => '“Ηищ вω щдαщ вц цж, одδ αтψ оψ тψщитхвхμ?”',
			5 => '“Щдψ жхйδ ψфыйαхαщвжх вц щдαщ цдψ αйцж тψщитхψρ.”',
			6 => '“Цж оψ λαх αμαвх λαттδ жищ дψт овйй.”',
			7 => '“Α одвцыψт пαδ ηψ цпαйй.”',
			8 => '“Ηищ щдψ ρвωωψтψхλψ ηψщоψψх θψтж αхρ жхψ...”',
			9 => '“...вц щдψ цαпψ αц щдψ ρвωωψтψхλψ ηψщоψψх жхψ αхρ ψщψтхвщδ.”',
			10 => '“Оψ овйй ёψψы оαщλд, ωжт оψ αтψ йжδαй.”',
			11 => '“Оψ овйй оαвщ ихщвй оψ цψψ дψт αμαвх.”',
			12 => '“Жит λтψαщжт...”',
			13 => '“Пαδ цдψ йвлψц вх ыψαλψ.”',
			'color' => 'yellow'
		),
		'✦执念的残火' => Array(
			0 => '“Щдвц вц щдψ Тψпαвхц жω Овцдψц, Цвμхвхμ вх!”',
			1 => '“...ΗΔ ПΑЫЙΨ...”',
			2 => '“...ΡΑΨПЖХ...”',
			3 => '“...ЦИЫЫЖТЩ ЦΔЦЩΨП...”',
			4 => '“...ДΨΑТЩ ΑХΡ ЦЖИЙ...”',
			5 => '“...ΛЖΡΨ ΑХΡ ЦЫВТВЩ...”',
			6 => '“ΑΡΑЫЩΑΗЙΨ ВХЩΨЙЙВΜΨХΛΨ”',
			7 => '“...ЦДΑЩЩΨТΨΡ ЫВΨΛΨЦ...”',
			8 => '“...ЦЩТΑΔЦ...”',
			9 => '“...ΑХ ΑХЖПΑЙΔ...”',
			10 => '“ΡВΑПЖХΡ ВХ ЩДΨ ТЖИΜД”',
			11 => '“ΨХΛТΔЫЩΨΡ ЦΨΜПΨХЩЦ...”',
			12 => '“ΗТВХΜ ДЖЫΨ...”',
			13 => '“...ЩЖ ЩДΨ ΩТΑВЙ ЖХΨЦ...”',
			'color' => 'yellow'
		),
		'✦希望的焰火' => Array(
			0 => '“Щдвц вц щдψ Ωвтψожтёц жω Джыψ, Цвμхвхμ вх!”',
			1 => '“Α λтδ вх ραтёхψцц...”',
			2 => '“Цйвхμ α джыψ щж ωищитψ.”',
			3 => '“Α йвμдщ жх щдψ оαщψт.”',
			4 => '“Μвлψ йвωψ щж иц.”',
			5 => '“Ηжтх ωтжп цйψψы. Тψцитωαλвхμ.”',
			6 => '“Λαййψρ ηδ α λтψαщжт.”',
			7 => '“Щдψтψ вц α ыитыжцψ.”',
			8 => '“Ωвтцщ, щдψтψ вц α цжихρ.”',
			9 => '“Щдψх, вщ ηψλжпψц α овйй.”',
			10 => '“Оψ αтψ αμαвх αоαёψхψρ ηδ вщ.”',
			11 => '“Αхρ щдвц щвпψ, оψ цψψ вщ щж щдψ ψхρ.”',
			12 => '“Цж щдψ ожтйρ овйй ηψ йψцц ψпыщδ.”',
			13 => '“Αхρ щджцψ одж оψтψ отжхμψρ λαх пαёψ щдвхμц твμдщ αμαвх.”',
			'color' => 'yellow'
		),
		'✦真实的火种' => Array(
			0 => '“Щдвц вц щдψ Щжтλд жω Щтищд, Цвμхвхμ вх!”',
			1 => '“我能吃下玻璃但不伤身体。”',
			2 => '“Йжтψп выцип ρжйжт цвщ αпψщ.”',
			3 => '“Ωαтψоψйй, Ψщαжвх Цдтρйи!”',
			4 => '“Оψ αтψ Ραψпжхц, Хжо ηψλжпвхμ Ωвтψцψψρ.”',
			5 => '“Щдψ кивλё ηтжох ωжф ξипыц жлψт щдψ йαθδ ρжμ.”',
			6 => '“我能吃下算盘但不伤身体。”',
			7 => '“我能吃下石碑但不伤身体。”',
			8 => '“我能吃下硬盘但不伤身体。”',
			9 => '“我能吃下内存但不伤身体。”',
			10 => '“我能吃下蛋糕但不伤身体。”',
			11 => '“我能吃下代码但不伤身体。”',
			12 => '“我能吃下按钮但不伤身体。”',
			13 => '“我能吃下在这里偷看代码的你但不伤身体。”',
			'color' => 'yellow'
		)
	),
);
$iteminfo = Array(//注意顺序，AB必须在A的前面，以此类推
	'Ag' => '同志饰物',
	'Al' => '热恋饰物',
	'AA' => '数据护盾',
	'AB' => '毒物中和',
	'A'  => '饰物',
	'Ah'  => '饰物',
	'Ac'  => '饰物',
	'B' => '电池',
	'C' => '药剂',
	'Ca' => '药剂',
	'Ce' => '药剂',
	'Ci' => '药剂',
	'Cp' => '药剂',
	'Cu' => '药剂',
	'Cw' => '药剂',
	'DN' => '内衣',#内衣
	'DB' => '身体装备',
	'DH' => '头部装备',
	'DA' => '手臂装备',
	'DF' => '腿部装备',
	'EE' => '电脑设备',
	'EW' => '天气控制',
	'ER' => '探测仪器',
	'HH' => '生命恢复',
	'HS' => '体力恢复',
	'HB' => '命体恢复',
	'HM' => '歌魂增加',
	'HT' => '歌魂恢复',
	'GBr' => '机枪弹药',
	'GBi' => '气体弹药',
	'GBh' => '重型弹药',
	'GBe' => '能源弹药',
	'GB' => '手枪弹药',	
	'M'=> '强化药物',
	'ME'=> '强化药物',
	'MH'=> '强化药物',
	'N' => '无',	
	'PM' => '歌魂增加',
	'PT' => '歌魂恢复',
	'PH' => '生命恢复',
	'PS' => '体力恢复',
	'PB' => '命体恢复',
	'p' => '礼物',
	'fy' => '全地图唯一的野生浮云礼物盒',
	'ygo' => '卡包',
	//'R' => '探测仪器',	
	'ss' => '歌词卡片',
	'T' => '陷阱',
	'U' => '扫雷设备',
	'V'=> '技能书籍',
	'VV'=> '技能书籍',
	'WN' => '空手',#空手
	'WGK' => '枪刃',#射+斩
	'WCF' => '符札',#投+符
	'WCP' => '重物',#投+殴
	'WKF' => '灵刃',#斩+符
	'WKP' => '重剑',#斩+殴
	'WFK' => '魔刃',#符+斩
	'WDG' => '巨炮',#爆+射
	'WDF' => '落魂',#爆+符
	'WJ' => '重型枪械',
	'WP' => '钝器',
	'WG' => '远程兵器',
	'WK' => '锐器',
	'WC' => '投掷兵器',
	'WD' => '爆炸物',
	'WF' => '灵力兵器',	
	'WQ' =>'？？？？',
	'XA' =>'代码残片·绿',
	'XB' =>'代码残片·紫',
	'XC' =>'代码残片·黄',
	'XX' =>'杀意已决',
	'XY' =>'杀意未决',
	'X' => '合成专用',
	'Y' => '特殊',
	'ZA' => '代码漏洞',
	'ZB'=> '称号卡',
	'Z' => '特殊',#不可合并
);

$itemspkinfo = Array(
	'A' => '全系防御',
	'a' => '属性防御',
	'B' => '伤害抹消',
	'b' => '属性抹消',
	'C' => '防投',
	'c' => '重击辅助',
	'D' => '防爆',
	'd' => '爆炸',
	'E' => '绝缘',
	'e' => '电击',	
	'F' => '防符',
	'f' => '灼焰',
	'G' => '防弹',
	'g' => '同志',
	'H' => 'HP制御',
	'h' => '伤害制御',
	'I' => '防冻',
	'i' => '冻气',
	'J' => '超量素材', 
	'j' => '多重',
	'K' => '防斩',
	'k' => '冰华',
	'L' => '致残',
	'l' => '热恋',
	'M' => '陷阱探测',
	'm' => '陷阱迎击',
	'N' => '冲击',
	'n' => '贯穿',
	'o' => '一发',
	'P' => '防殴',
	'p' => '带毒',
	'q' => '防毒',
	'R' => '混沌伤害',
	'r' => '连击',
	'S' => '消音',
	's' => '调整',
	'U' => '防火',
	'u' => '火焰',
	'v' => '灵魂绑定',
	'W' => '隔音',
	'w' => '音波',
	'X' => '直死', //NPC专用
	'x' => '奇迹',
	'y' => '破格', //属穿
	'Z' => '菁英',
	'z' => '天然',
	'-' => '精神抽取',
	'*' => '灵魂抽取',
	'+' => '技能抽取',
	'^' => '背包',
);

$iteminfo_tooltip_desc = Array
(
	# 用于记录一些内容重复但来源不同的描述
	# 不能改善性能，但是可以保护视力与腱鞘？……大概吧
	#0:巫师物品
	0 => Array('class'=>'spitem2', 'title'=>"为游戏做出过贡献的巫师的装备。",),
	#1:福袋SR
	1 => Array('class'=>'neonorange', 'title'=>"从幸运礼物福袋中以二成几率左右能开出的强力装备。",),
	#2:福袋SSR
	2 => Array('class'=>'rainbow', 'title'=>"从幸运礼物福袋中以极低几率左右能开出的强力装备。",),
	#3:钉
	3 => Array('title'=>"为手中名字带有“棍棒”的钝器打钉子，以增加效果值"),
	#4:磨刀石
	4 => Array('title'=>"让手中锐器更加锋利，以增加效果值"),
	#5:针线包
	5 => Array('title'=>"增加装备着的身体防具的效果值"),
	#99: ???
	99 => Array('title'=>"……这、这是什么？！"),
);

$iteminfo_tooltip = Array
(
	# 强化道具
	'钉' => 3, '钢钉' => 3, '艾莲娜的圣钉' => 3, '埃克法-冰凌-钉' => 3,
	'磨刀石' => 4, '黑磨刀石' => 4, '沉默磨刀石' => 4, '贤者之磨刀石' => 4, '埃克法-融炼-磨刀石' => 4,
	'针线包' => 5,
	# 特殊道具
	'武器师安雅的奖赏' => Array('title'=>"强化手中武器的效果值、耐久值，或者将类型转变为你更擅长的系别"),
	'凸眼鱼' => Array('title'=>"使用后可以销毁整个战场现有的尸体"),
	'杏仁豆腐的ID卡' => Array('title'=>"连斗后使用可以让全场NPC消失并进入『死斗阶段』"),
	'水果刀' => Array('title'=>"可以切水果。如果不会用可能会切到自己"),
	'探测器电池' => Array('title'=>"使用后可以为探测仪器供电"),
	# 怪东西
	'■DeathNote■' => 99, '奇怪的按钮' => 99, '『S.C.R.A.P』' => 99,
	# 电掣装置
	'魔法蜂针' => Array('class'=>'spitem', 'title'=>"这个武器一定会对敌人造成350点伤害，但对防御非常高的敌人除外。",),
	'临摹装置' => Array('class'=>'spitem', 'title'=>"这个武器在主动攻击对手时，将可以复制对手的武器。注意：对手武器数值太高时会失败，后果自负！",),
	# 巫师物品
	'■胶冻の巴雷特■' => 0,'■胶冻的风衣■' => 0,'■胶冻的兜帽■' => 0,'■胶冻的跑鞋■' => 0,'■胶冻的手套■' => 0,'■胶冻的吊坠■' => 0,
	'■便携式火力平台■' => 0,'■Type3防弹插板■' => 0,'■VFL 6-24×56光学瞄具■' => 0,'■IOP T4外骨骼■' => 0,'■热光学迷彩披风■' => 0,'■遗留的武器库■' => 0,
	'【工作用数位板】' => 0,'【学园针织罩衫】' => 0,'【鱼形发卡】' => 0,'【学园制服鞋】' => 0,'【工作用数位笔】' => 0,'【布艺猫咪挂件】' => 0,
	# 福袋SR
	'「信仰之山」' => 1,'「间断的噩梦」' => 1,'「运钝根的捕物帐」' => 1,'「喧嚣叙事曲」' => 1,'「升天」' => 1,
	'「曳光」' => 1,'「人生重来箱」' => 1,'「菁英宅之怒」' => 1,'闭锁世界的冥神 Ｌ5' => 1,'铁兽式强袭机动兵装改牛头伯劳2 Ｌ5' => 1,
	'防火龙·暗流体 Ｌ5' => 1,'前托枪管龙 Ｌ5' => 1,'电子界到临者＠火灵天星 Ｌ6' => 1,'「活跃迎春曲」' => 1,'「飘落」' => 1,'「明动」' => 1,
	'「正午高阳」' => 1,'神灭兵器－天霆号扼宙斯 ☆12' => 1,'「碧海船歌」' => 1,'「翼展」' => 1,'「安谧」' => 1,
	'「午前许愿」' => 1,'神之圣剑' => 1,'「龙怒」' => 1,'「升天」' => 1,'「宁静」' => 1,'「清晨恩典」' => 1,'神之棍棒' => 1,
	# 福袋SSR
	'随机数之神的棍棒' => 2,'随机数之神的圣剑' => 2,'随机数之神的泪水' => 2,
	'随机数之神的神力' => 2,'随机数之神的震撼' => 2,'随机数之神的摄理' => 2,'随机数之神的恶戏' => 2,
);

$itemkinfo_tooltip = Array
(
	'Ag' => Array('title' =>"可能带有同志属性",),
	'Al' => Array('title' =>"可能带有热恋属性",),
	'Ah' => Array('title' =>"可能带有？？？属性",),
	'Ac' => Array('title' =>"可能带有重击辅助属性",),
	'B'  => Array('title' =>"使用后可以为电脑设备供电",),
	'C'  => Array('title' =>"使用后可以解除异常状态",),
	'Ce' => Array('title' =>"使用后可以解除麻痹状态",),
	'Ci' => Array('title' =>"使用后可以解除冻结状态",),
	'Cp' => Array('title' =>"使用后可以解除中毒状态",),
	'Cu' => Array('title' =>"使用后可以解除烧伤状态",),
	'Cw' => Array('title' =>"使用后可以解除混乱状态",),
	'EE' => Array('title' =>"使用后有一定概率能够解封当前禁区，需要电池充电",),
	'EW' => Array('title' =>"使用后可改变当前天气，对极端天气无效",),
	'ER' => Array('title' =>"使用后可激活雷达界面",),
	'HH' => Array('title' =>"使用后恢复等于道具效果值的生命",),
	'HS' => Array('title' =>"使用后恢复等于道具效果值的体力",),
	'HB' => Array('title' =>"使用后恢复等于道具效果值的生命和体力",),
	'HM' => Array('title' =>"使用后增加等于道具效果值的歌魂上限",),
	'HT' => Array('title' =>"使用后恢复等于道具效果值的歌魂",),
	'PM' => Array('title' =>"使用后曾加等于道具效果值的歌魂上限",),
	'PT' => Array('title' =>"使用后灰复等于道具效果值的歌魂",),
	'PH' => Array('title' =>"使用后灰复等于道具效果值的生命",),
	'PS' => Array('title' =>"使用后灰复等于道具效果值的体力",),
	'PB' => Array('title' =>"使用后灰复等于道具效果值的生命和体力",),
	'PB2' => Array('title' =>"使用后灰复等于道具效果值的生命和体力",),
	'GBr'=> Array('title' =>"为带有“连击”属性，且不适用“能源、气体弹药”的枪械供弹",),
	'GBi'=> Array('title' =>"为带有“火焰、冻气”属性，且不适用“能源弹药”的枪械供弹",),
	'GBh'=> Array('title' =>"为“重型枪械”供弹",),
	'GBe'=> Array('title' =>"为带有“电击、音波”属性的枪械供弹",),
	'GB' => Array('title' =>"为普通枪械供弹",),
	'V'  => Array('title' =>"使用后会根据道具效果值获得一定的熟练度",),
	'M'  => Array('title' =>"使用后会根据道具效果值强化特定属性",),
	'MA' => Array('title' =>"使用后会根据道具效果值强化攻击力",),
	'MD' => Array('title' =>"使用后会根据道具效果值强化防御力",),
	'ME' => Array('title' =>"使用后会根据道具效果值获得一定的经验值",),
	'MH' => Array('title' =>"使用后会根据道具效果值强化生命上限",),
	'MS' => Array('title' =>"使用后会根据道具效果值强化体力上限",),
	'T'  => Array('title' =>"使用后可以在当前地区埋设一枚陷阱",),
	'U'  => Array('title' =>"使用后将扫除当前地区内的一枚陷阱……但是这一切真的值得吗？",),
	'WGK'=> Array('title' =>"兼具射击与斩击功效的武器",),
	'WCF'=> Array('title' =>"兼具投掷与灵力功效的武器",),
	'WCP'=> Array('title' =>"兼具投掷与打击功效的武器",),
	'WKF'=> Array('title' =>"兼具斩击与灵力功效的武器",),
	'WKP'=> Array('title' =>"兼具斩击与打击功效的武器",),
	'WFK'=> Array('title' =>"兼具灵力与斩击功效的武器",),
	'WDG'=> Array('title' =>"兼具伏击与射击功效的武器",),
	'WDF'=> Array('title' =>"兼具伏击与灵力功效的武器",),
	'AA' => Array('class'=>'spitem', 'title'=>"可以将一定数量的攻击次数伤害变为0，那之后失效",),
	'AB' => Array('class'=>'spitem', 'title'=>"装备后，对补给品使用毒药下毒变为为其解毒。",),
	'XA' => Array('class'=>'lime', 'title'=>"集齐三个同颜色的不同名代码残片，来合成单人脱出结局道具吧！",),
	'XB' => Array('class'=>'purple', 'title'=>"集齐三个同颜色的不同名代码残片，来合成单人脱出结局道具吧！",),
	'XC' => Array('class'=>'yellow', 'title'=>"集齐三个同颜色的不同名代码残片，来合成单人脱出结局道具吧！",),
	'ZB' => Array('class'=>'lime', 'title'=>"在没有决定称号的时候使用该物品，便可获得该对应称号。",),
	'ZA' => Array('class'=>'neonyellow', 'title'=>"这个物品中似乎含有让你可以独自脱离幻境的方法……",),
);

$itemspkinfo_tooltip = Array
(
	'A' => Array('title' => "高概率将殴斩射投爆灵六系对你的伤害减半。",),//测试用
	'a' => Array('title' => "高概率将毒火冻电乱音以及爆炸对你的伤害减半。并避免异常状态。",),//测试用
	'B' => Array('title' => "极高概率将全部物理伤害变为1。",),
	'b' => Array('title' => "极高概率将全部属性伤害变为1。",),
	'C' => Array('title' => "高概率将投系对你的物理伤害减半。",),
	'c' => Array('title' => "降低重击与必杀技的怒气消耗，以及重击概率。",),
	'D' => Array('title' => "高概率将爆系对你的物理伤害，以及爆炸属性伤害减半。",),
	'd' => Array('title' => "攻击对手时，将产生额外的爆炸属性伤害。",),
	'E' => Array('title' => "高概率将电击属性对你的属性伤害减半。并避免身体麻痹状态。",),
	'e' => Array('title' => "攻击对手时，将产生额外的电击属性伤害。也有可能让对手陷入身体麻痹异常状态。",),	
	'F' => Array('title' => "高概率将灵系对你的物理伤害减半。",),
	'f' => Array('title' => "攻击对手时，对其造成无法防御的火焰属性伤害。也有可能让对手陷入烧伤异常状态。",),
	'G' => Array('title' => "高概率将射系（包括重型枪械）对你的物理伤害减半。",),
	'g' => Array('title' => "低概率在攻击异性敌人时伤害加倍，但攻击同性的物理伤害降为1。",),
	'H' => Array('title' => "将你受到的反噬伤害降低90%。",),
	'h' => Array('title' => "高概率将你受到的最高伤害压制在两千左右。",),
	'I' => Array('title' => "高概率将冻气属性对你的属性伤害减半。并避免冻结状态。",),
	'i' => Array('title' => "攻击对手时，将产生额外的冻气属性伤害。也有可能让对手陷入冻结异常状态。",),
	'J' => Array('title' => "将卡片变成可以进行超量合成的素材。",),
	'j' => Array('title' => "使用「武器模式」命令可将该物品转变为其他形态。",),
	'K' => Array('title' => "高概率将斩系对你的物理伤害减半。",),
	'k' => Array('title' => "攻击对手时，对其造成无法防御的冻气属性伤害。也有可能让对手陷入冻结异常状态",),
	'L' => Array('title' => "攻击对手时，让对手的冷却时间大幅度增加。",),
	'l' => Array('title' => "低概率在攻击同性敌人时伤害加倍，但攻击异性的物理伤害降为1。",),
	'M' => Array('title' => "提高一定陷阱回避率。",),
	'm' => Array('title' => "触发陷阱时，中机率免疫其伤害。",),
	'N' => Array('title' => "攻击对手时，中几率将对手防具的防御力修正为一半来计算伤害。",),
	'n' => Array('title' => "攻击对手时，一定几率无效抹消类与防御类属性。",),
	'o' => Array('title' => "这是一把不能装子弹的武器。",),
	'P' => Array('title' => "高概率将殴系对你的物理伤害减半。",),
	'p' => Array('title' => "攻击对手时，将产生额外的毒属性伤害。也有可能让对手陷入中毒异常状态。",),
	'q' => Array('title' => "高概率将毒属性对你的属性伤害减半。并避免中毒状态。",),
	'R' => Array('title' => "这把武器的最终伤害将会为随机值。",),
	'r' => Array('title' => "根据你的熟练度，做出一定数量的连续攻击。",),
	'S' => Array('title' => "枪支类武器开火时不会产生声音。",),
	's' => Array('title' => "这个物品是游戏王同调合成的必备素材。",),
	'U' => Array('title' => "高概率将火焰属性对你的属性伤害减半。并避免烧伤状态。",),
	'u' => Array('title' => "攻击对手时，将产生额外的火焰属性伤害。也有可能让对手陷入烧伤状态。",),
	'v' => Array('title' => "丢弃本物品，或你死亡时，本物品会消失。",),
	'W' => Array('title' => "高概率将音波属性对你的属性伤害减半。并避免混乱状态。",),
	'w' => Array('title' => "攻击对手时，将产生额外的音波属性伤害。也有可能让对手陷入混乱异常状态。",),
	'X' => Array('title' => "可能会一击必杀。",),
	'x' => Array('title' => "人类，可以挑战神么？",),
	'y' => Array('title' => "攻击对手时，一定几率无效属性抹消类与属性防御类属性，并增加让对手陷入异常状态的概率。",),
	'Z' => Array('title' => "该物品可以使用特定物品进行强化。",),
	'z' => Array('title' => "那么，这个有什么用呢……？",),
	'-' => Array('title' => "战斗时无效双方的防具效果。",),
	'*' => Array('title' => "战斗时无效双方的武器·饰品效果，并大幅度降低灵系伤害。",),
	'+' => Array('title' => "战斗时大幅度向低修正双方的熟练度。",),
	'^' => Array('title' => "装备后，可使用「背包」相关指令存储物品。",),
);

//头衔文字效果：
//因为一些历史遗留问题，这部分样式文本会直接存进数据库的news表里，所以……不要超过200个字……
//什么历史遗留问题？……就是现在所有$nick都是 $nick.' '.$name 这样存进同一个字段里的……这没法拆啊！
$title_desc = Array
(
	# class-样式 title-提示悬浮框 img-图片url，会覆盖样式与悬浮框 
	'参展者' => Array('title'=>"参展者就是参加会展的人……你还记得自己是来参加动漫展的吧？"),
	'补给掠夺者' => Array('class'=>'yellow', 'title'=>"你是真能吃啊！"),
	'弱子' => Array('img'=>"img/nicktest.png",)
);

//所有在player表里登记过的合法字段都可以写进里面 //非法内容会被自动过滤掉……大概吧
//同时，也支持合法的运算符，写在 [::] 内可以自动识别…… //呃试着做了下感觉有风险，还是写死吧，暂时只支持 += -= *= /= 四种吧，应该够用了吧？
//比如入场时斩熟+50 就写 'wk' => '[:+=:]50',
$title_valid = Array
(
	'弱子' => Array(
		'clbpara' => Array('cheater' => 1,),
	),
	'参展者' => Array(
		'arb' => '二次元漫展背包', 'arbk' => 'DB', 'arbe' => 2,  'arbs' => 2, 'arbsk' => '^',
	),
	'叶子钦定！' => Array(
		'itm5' => '核子面包', 'itmk5' => 'HH', 'itme5' => 237,  'itms5' => 5, 'itmsk5' => '',
		'itm6' => '核子矿泉水', 'itmk6' => 'HS', 'itme6' => 237,  'itms6' => 5, 'itmsk6' => '',
	),
	'寻星者' => Array(
		'wk' => '[:+=:]50',
		'wep' => '『寻星勇者』', 'wepk' => 'WK', 'wepe' => 90,  'weps' => 35, 'wepsk' => 'd',
	),
	'TERRA' => Array(
		'itm6' => '篝酱的奇迹☆胶带～棍', 'itmk6' => 'WP', 'itme6' => 42,  'itms6' => 300, 'itmsk6' => 'dej',
	),
	'越红者' => Array(
		'itm6' => '红杀铁剑', 'itmk6' => 'WK', 'itme6' => 60,  'itms6' => 30, 'itmsk6' => 'N',
	),
	'跨过彩虹' => Array(
		'itm6' => 'AZURE RONDO模样的杏仁豆腐', 'itmk6' => 'WF', 'itme6' => 233,  'itms6' => 1, 'itmsk6' => 'd',
	),
	'l33t' => Array(
		'itm1' => '键 希望弹模样的杏仁豆腐', 'itmk1' => 'WC', 'itme1' => 500,  'itms1' => 1, 'itmsk1' => 'z',
		'itm2' => '键 燃烧弹模样的杏仁豆腐', 'itmk2' => 'WF', 'itme2' => 500,  'itms2' => 1, 'itmsk2' => 'z',
		'itm3' => '键 生命弹模样的杏仁豆腐', 'itmk3' => 'WG', 'itme3' => 500,  'itms3' => 1, 'itmsk3' => 'z',
		'itm4' => '键 未来弹模样的杏仁豆腐', 'itmk4' => 'WP', 'itme4' => 500,  'itms4' => 1, 'itmsk4' => 'z',
		'itm5' => '键 催泪弹模样的杏仁豆腐', 'itmk5' => 'WD', 'itme5' => 500,  'itms5' => 1, 'itmsk5' => 'z',
		'itm6' => '键 旅途弹模样的杏仁豆腐', 'itmk6' => 'WK', 'itme6' => 500,  'itms6' => 1, 'itmsk6' => 'z',
	),
	'赌玉狂魔' => Array(
		'money' => '[:+=:]3210',
		'wep' => '增殖之腿', 'wepk' => 'WCP', 'wepe' => 10,  'weps' => '∞', 'wepsk' => 'd',
	),
	'美食家' => Array(
		'itm1' => '裱花布里欧修', 'itmk1' => 'HH', 'itme1' => 255,  'itms1' => 10, 'itmsk1' => 'z',
		'itm2' => '埃斯卡依云斐济水', 'itmk2' => 'HS', 'itme2' => 255,  'itms2' => 20, 'itmsk2' => 'z',
		'itm6' => '强效西柚汁', 'itmk6' => 'HB', 'itme6' => 127,  'itms6' => 15, 'itmsk6' => 'z',
	),
	'殴系爱好者' => Array(
		'wp' => '[:+=:]50',
		'itm6' => '「铁拳无敌」称号卡', 'itmk6' => 'ZB', 'itme6' => 1,  'itms6' => 1, 'itmsk6' => '',
	),
	'斩系爱好者' => Array(
		'wk' => '[:+=:]50',
		'itm6' => '「见敌必斩」称号卡', 'itmk6' => 'ZB', 'itme6' => 2,  'itms6' => 1, 'itmsk6' => '',
	),
	'投系爱好者' => Array(
		'wc' => '[:+=:]50',
		'itm6' => '「灌篮高手」称号卡', 'itmk6' => 'ZB', 'itme6' => 3,  'itms6' => 1, 'itmsk6' => '',
	),
	'爆系爱好者' => Array(
		'wd' => '[:+=:]50',
		'itm6' => '「拆弹专家」称号卡', 'itmk6' => 'ZB', 'itme6' => 5,  'itms6' => 1, 'itmsk6' => '',
	),
	'射系爱好者' => Array(
		'wg' => '[:+=:]50',
		'itm6' => '「狙击鹰眼」称号卡', 'itmk6' => 'ZB', 'itme6' => 4,  'itms6' => 1, 'itmsk6' => '',
	),
	'灵系爱好者' => Array(
		'wf' => '[:+=:]50',
		'itm6' => '「超能力者」称号卡', 'itmk6' => 'ZB', 'itme6' => 9,  'itms6' => 1, 'itmsk6' => '',
	),
	'实用主义者' => Array(
		'wp' => '[:+=:]25','wk' => '[:+=:]25','wc' => '[:+=:]25','wd' => '[:+=:]25','wg' => '[:+=:]25','wf' => '[:+=:]25',
		'itm6' => 'SPECIAL TECH 「特选科技」', 'itmk6' => 'p0O1', 'itme6' => 1,  'itms6' => 1, 'itmsk6' => '',
	),
);

//club20 元素大师：
//元素列表 可能需要一些布灵布灵的特效
$sparkle = '<span class="sparkle">✨</span>';
$elements_info = Array
(
	0 => $sparkle.'<span class="mtgcolorless">亮晶晶</span>'.$sparkle,
	1 => $sparkle.'<span class="mtgred">暖洋洋</span>'.$sparkle,
	2 => $sparkle.'<span class="mtgblue">冷冰冰</span>'.$sparkle,
	3 => $sparkle.'<span class="mtggreen">郁萌萌</span>'.$sparkle,
	4 => $sparkle.'<span class="mtgwhite">昼闪闪</span>'.$sparkle,
	5 => $sparkle.'<span class="mtgblack">夜静静</span>'.$sparkle,
);
//安全箱位置
$depots = Array(5,28);
$shops = Array(0,14,27);
$hospitals = Array(11,19,32);
$plsinfo = Array(
	0=>'无月之影',
	1=>'端点',
	2=>'RF高校',
	3=>'雪之镇',
	4=>'索拉利斯',
	5=>'指挥中心',
	6=>'梦幻馆',
	7=>'清水池',
	8=>'白穗神社',
	9=>'墓地',
	10=>'麦斯克林',
	11=>'对天使用作战本部',
	12=>'夏之镇',
	13=>'三体星',
	14=>'光坂高校',
	15=>'守矢神社',
	16=>'常磐森林',
	17=>'常磐台中学',
	18=>'秋之镇',
	19=>'精灵中心',
	20=>'春之镇',
	21=>'圣Gradius学园',
	22=>'初始之树',
	23=>'幻想世界',
	24=>'永恒的世界',
	25=>'妖精驿站',
	26=>'键刃墓场',
	27=>'花菱商厦',
	28=>'FARGO前基地',
	29=>'风祭森林',
	30=>'天使队移动格纳库',
	31=>'和田町研究所',
	32=>'SCP研究设施',
	33=>'雏菊之丘',
	34=>'英灵殿'
);
$hplsinfo = Array
(
	# 隐藏地点列表。位于哪组隐藏地点是通过使用players表内字段'pgroup'判断的。隐藏地点的编号不能与标准地点编号重复。
	# 0是标准地图组。另附：254号被我用来扔销毁过的尸体了……如果登记成一个地图的话，倒也不会在里面摸到尸体，但是……怎么说呢……阴气太重了！
	# TODO：还有一个大工程没做：只能听到同一地图组内的声音信息。现在先偷懒设置成隐藏地图内不会产生声音了。
	1 => Array
	(
		101 => '测试地图1A',
		102 => '测试地图2A',
		103 => '测试地图3A',
	),
	2 => Array
	(
		111 => '测试地图1B',
		112 => '测试地图2B',
		113 => '测试地图3B',
		114 => '测试地图4B',
	),
);
$xyinfo = Array(
	0=>'B-2',
	1=>'A-6',
	2=>'H-3',
	3=>'B-6',
	4=>'F-10',
	5=>'D-6',
	6=>'H-6',
	7=>'F-3',
	8=>'E-10',
	9=>'J-4',
	10=>'I-8',
	11=>'D-8',
	12=>'F-9',
	13=>'H-4',
	14=>'H-8',
	15=>'G-1',
	16=>'I-2',
	17=>'A-5',
	18=>'G-4',
	19=>'D-4',
	20=>'I-7',
	21=>'F-7',
	22=>'J-6',
	23=>'A-8',
	24=>'C-9',
	25=>'D-2',
	26=>'A-1',
	27=>'F-8',
	28=>'E-1',
	29=>'F-5',
	30=>'F-6',
	31=>'J-1',
	32=>'J-2',
	33=>'F-4',
	34=>'J-10',
	'hidden'=>'■-■',
);
$areainfo = Array
	(
	0=>"充满了灵力的永久禁区，也是整个战场的入口。<br>逗留在这里也许会被时空吞噬……<br><span class=\"yellow\">买完东西就快点离开吧。</span><br>",
	1=>"蓝白色的大地上仿佛有种令人心悸的波动在回荡。<br>还是快离开吧。<br>",
	2=>"这是一所位于郊区的高校。<br>之前毕业旅行的学生似乎遇到了惨烈的交通事故，幸存的学生们大概接受心理疏导去了吧。<br>",
	3=>"飘着雪花的北国小镇，俄罗斯风格的建筑使人愈发感到寒冷。<br>",
	4=>"柔软的大地不断变化，在人眼前生长成巨大而诡异的形状，然后在海水的冲刷下四散崩溃。<br>这究竟是什么地方？<br>",
	5=>"海风的腥味表明这幢建筑似乎是从某个岛屿上移动过来的。<br><span class=\"yellow\">自动防御系统还在忠实地工作着，看来需要随时保持警惕。</span><br>",
	6=>"建筑里外都充满了向日葵的香味，然而四处散布的妖怪气息依然让人不寒而栗。<br><span class=\"yellow\">自动防御系统还在忠实地工作着，看来需要随时保持警惕。</span><br>",
	7=>"各种各样的雕像环绕着一个欧式的大水池。<br>池水十分清澈，也许可以直接饮用。<br>",
	8=>"神社空无一人。<br>但是，在这里仰望天空的话，总觉得会被某种忧伤的思绪所感染。<br>",
	9=>"这里埋葬着很多被当做祭品杀死的怪兽。<br>不知道是怎样奇怪的召唤仪式呢……<br>",
	10=>"一踏入这里，身躯就觉得沉重，而且气压也好像陡然增加了许多。<br>大概是个不宜久留的地方。<br>",
	11=>"充满了各种夸张的陷阱的房间，似乎是某所高校的校长室。<br><span class=\"yellow\">在这里，似乎不管受到怎样的伤害也会很快回复。</span><br>",
	12=>"洒满了阳光的靠海的村庄，青色的天空吸引人久久凝望、不能罢怀。<br>",
	13=>"这里连时令都错乱了么？<br>不仅昼夜错乱、忽冷忽热，有时甚至有两三个太阳同时升起……<br>",
	14=>"长长的坂道的尽头是一所学校。<BR>学校规模不小，但总给人寂寥无人之感。<br><span class=\"yellow\">从校内的自动售货机似乎能买到些什么。</span><br>",
	15=>"高大的御柱环绕在山中湖泊周围。尽管景色美丽，却找不见本应在此的巫女。<br>",
	16=>"浓郁的树叶遮住了阳光，是容易被袭击的地方啊……<br>林间不时还有奇怪的生物出没……<br>听说这附近每隔十年都会有超能力者诞生。<br>",
	17=>"不同于现世的先进设备兀自运转着，令人觉得是不是来到了某个技术先进的域外之城。<br><span class=\"yellow\">自动防御系统还在忠实地工作着，看来需要随时保持警惕。</span><br>",
	18=>"与其他住宅区相比，这里的商店特别多。<BR>虽然如此，整个城市弥漫着一种莫名的悲伤的气氛……<br>",
	19=>"巨大的建筑物内，不知名的设备依然在运转。<br>根据残缺不全的说明，<span class=\"yellow\">也许这些机器可以为人治疗伤口和恢复精力？</span><br>",
	20=>"尽管处于春季，也无法掩饰衰败的萧条小镇。<br>逗留在这里总使人感到命运无情……<br>",
	21=>"表面上看去像是标准的贵族女校，<br>有着与学校不相称的停机坪和地下仓库。<br>",
	22=>"在绿地上孤零零矗立的大树，像是一座纪念碑。<BR>这到底意味着什么呢？<br>",
	23=>"被白雪笼罩，一片荒芜的空间……<BR>时空错乱了吗？为什么我会在这里？<br>",
	24=>"诡异的地方……脚下已经看不见什么地面了……<BR>这个地方究竟是什么？<br>",
	25=>"一间孤独的小屋子。<br>貌似没有人住在这里了。<br>门上贴着告示：<br>TRAIN WITH MY HOLOGRAM IF YOU WANT TO --- GA-04<br>",
	26=>"代表火与血的牺牲的曾经的战场。<BR>冰封的力量已经不在。<br><span class=\"yellow\">你仍然感觉到一股苍凉的杀气！是你的错觉么！</span><br>",
	27=>"荒废的都市里，顶层有着天象馆的废弃商场。<BR>虽然大部分区域都停电了，<span class=\"yellow\">角落里的自动售货机似乎还能运行。</span><br>",
	28=>"现在已经是一团废墟的遗迹。<BR>可能能找到有用的物品也说不定。<br>",
	29=>"传说有神秘力量的森林。<BR>谁知道这个地方会出现什么。<br>",
	30=>"在远处看这个建筑你还以为那是一个集装箱，<BR>走进去以后才发现这里别有洞天。<br>庞大的电脑系统正在忠实地工作着。<br>",
	31=>"最近突然在地平线远端出现的大型建筑，<BR>你注意到建筑的后院时空裂缝之外貌似还有一个小镇……<br>",
	32=>"最近突然在地平线远端出现的第二座大型建筑，<BR>感觉有种不祥的气息……<br>",
	33=>"风祭森林的最深处。<BR>被盛开的雏菊花覆盖着的山丘。<BR>山丘上貌似有个身影坐着，<BR>还是离她远一点为妙。<BR>",
	34=>"总而言之这里就是英灵殿了。<BR>",
	101 => '位于狭窄甬道两侧的灯光随着你的步调依盏亮起……又在你身后悄然熄灭。回过神来时，你已置身于一片黑暗中了。<BR>',
	102 => '空旷的大厅内，零星竖立着几根残破不堪的支撑柱。<BR>不知是不是错觉……你感到有什么东西隐藏在立柱背后的阴影里。<BR>',
	103 => '敞开的穹顶从夜空接引下一束清冷月光。<br>在月光映照下，你的前方已是一片坦途。<br>',
);



$dinfo = Array(
	10 => '不知道什么原因，你死去了。<br>这应该是一个BUG，请通知管理员。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】所以说这是什么意思？</span><br><span class="blueseed">【Ｐ】这大概是上层叙事的锅，死亡方法没配上正确的回复，按照系统说的做吧。</span><br><span class="redseed">【Ｅ】所以说我们在这里的意义是？</span><br><span class="blueseed">【Ｐ】就算是上层叙事，人也是会犯错误的嘛，也有人会好奇看代码仓库呢对吧。</span><br><span class="redseed">【Ｅ】行吧，那就这样，屏幕这边的你记得去汇报给冴冴！快去！</span><br></div>',
	11 => '“滴滴滴——”<br>这是……手机闹铃的提示音？<br>“糟糕！还没确认这次的禁区情况——”<br>还没等你有所反应，死神一般的空间裂缝已经把你吞没了。<br>等待你的只有死亡……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】唔……我得说这是个时间管理问题……</span><br><span class="redseed">【Ｅ】这个游戏中，「进行状况」页面会有禁区的提示。</span><br><span class="blueseed">【Ｐ】而且红暮和蓝凝在每个禁区到来前也会进行播报。</span><br><span class="redseed">【Ｅ】话说她们两个在这点上怎么对玩家这么好，玩家死的快一点对她们不是好事么？</span><br><span class="blueseed">【Ｐ】谁知道呢……</span><br></div>',
	12 => '“呜……到此为止了吗……”<br>毒素造成的痛苦让你无法再坚持下去了。<br>你吐出嘴里最后一点深黑的血液，仰面倒了下去。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】啊呀呀……这是中毒死了呢……</span><br><span class="redseed">【Ｅ】中毒以后最直观的方法便是找「解毒剂」吃，商店也有卖。</span><br><span class="blueseed">【Ｐ】中了毒就别死撑着了，因为探索和移动都会造成相当的伤害。</span><br><span class="redseed">【Ｅ】而且中毒时如果再被毒属性的攻击打到，便是屋漏恰逢连夜雨，受到额外的伤害呢。</span><br><span class="blueseed">【Ｐ】顺便一提，也可以使用技能点来解毒，某个社团更可以直接通过点击界面上中毒（POISONED）的字样进行解毒呢！</span><br></div>',
	13 => '“不好！”<br>也许在平时的你看来，这只是小菜一碟……<br>但对于此刻遍体鳞伤的你来说，<br>眼前的突发状况无异于压垮骆驼的最后一根稻草。<br>你不甘心地倒下了，再也没有起来。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】这就叫做……量变造成质变。</span><br><span class="blueseed">【Ｐ】这游戏中的即死外事件对你应该只会造成轻微伤害。</span><br><span class="redseed">【Ｅ】但就算伤害再轻微，也会成为压垮犯下决定性错误的你的稻草。</span><br><span class="blueseed">【Ｐ】所以你得要记着了，时刻保证你的生命值，以免再度阴沟翻船。</span><br><span class="redseed">【Ｅ】只能祝你下次好运呢。</span><br></div>',
	14 => '“也许咱应该断定你上网成瘾？”<br>这是……林无月的声音！<br>从哪里传来的？<br>她怎么会知道我试图入侵虚拟世界的控制系统？<br>还没等你反应过来，你就两眼一黑，什么都不知道了。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】这里有个福利，你最好记住了——</span><br><span class="blueseed">【Ｐ】游戏中一般情况下PC解禁的成功率是六成来着。</span><br><span class="redseed">【Ｅ】但在这之外，如果骰子出了大失败，那么你就会挂点，就像现在这样。</span><br><span class="blueseed">【Ｐ】如果不想再度碰见这种情况，就找个「锡安组织」的称号的玩家帮你解禁吧。</span><br><span class="redseed">【Ｅ】而且这个称号解禁的成功率也会大幅度提高哦。<br></div>',
	15 => '“我很抱歉，不过这是林无月的意思。”<br>面前突然出现的，是一个陌生男子。<br>这人说些什么怪话呢？<br>你正要上前问个究竟，只见男子手中白光一闪，你的意识就此烟消云散。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】这个……没啥说法呢。</span><br><span class="blueseed">【Ｐ】某个上位存在的GM在后台管理中将你干掉了。</span><br><span class="redseed">【Ｅ】我觉得肯定是有原因的吧。</span><br><span class="blueseed">【Ｐ】但这不是我们应该决断的事情。</span><br><span class="redseed">【Ｅ】那么我们也就闭嘴了。</span><br></div>',
	16 => '“我很抱歉，不过这是林无月的意思。”<br>面前突然出现的，是一个陌生男子。<br>这人说些什么怪话呢？<br>你正要上前问个究竟，只见男子手中白光一闪，你的意识就此烟消云散。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】这个……没啥说法呢。</span><br><span class="blueseed">【Ｐ】某个上位存在的GM在后台管理中将你干掉了。</span><br><span class="redseed">【Ｅ】我觉得肯定是有原因的吧。</span><br><span class="blueseed">【Ｐ】但这不是我们应该决断的事情。</span><br><span class="redseed">【Ｅ】从这个功能的用法上，这句话应该只有GM或者看代码仓库的人才会看到吧，你们好！</span><br></div>',
	17 => '“呜……到此为止了吗……”<br>身体已被冰雹砸得千疮百孔，伤痛让你无法再坚持下去了。<br>你脚下一软，向前栽倒，失去了意识。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】人哟，为何要挑战自然天象……</span><br><span class="redseed">【Ｅ】别看冰雹一次可能就这么点伤害，其实是按照比率扣血的。</span><br><span class="blueseed">【Ｐ】没有补给的话，动十几次你就很危险了，就像这样。</span><br><span class="redseed">【Ｅ】还是躲起来等禁区或者找改天气的道具吧。</span><br><span class="blueseed">【Ｐ】或者你自认为血条比较长或者补给比较多，也可以硬抗，但我们也不知道你是不是就是因为没抗住才变成这样的呢？</span><br></div>',
	18 => '“呜……到此为止了吗……”<br>烧伤导致的伤痛让你无法再坚持下去了。<br>你脚下一软，向前栽倒，失去了意识。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】你可能会觉得，火烧毁一切，也让你落了命，实在是令人不爽。</span><br><span class="redseed">【Ｅ】但对于我们来说，火是生命的化身。</span><br><span class="blueseed">【Ｐ】唔，我们扯远了，总之烧伤你需要找「烧伤药剂」，或者使用技能点治疗。</span><br><span class="redseed">【Ｅ】也可以在能躺的地方进行「静养」一段时间。</span><br><span class="blueseed">【Ｐ】某个社团也可以直接点击界面上的烧伤（BURNED）状态进行解除。</span><br></div>',
	20 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个挥舞双拳的身影，在你失神的瞳孔中逐渐淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】拳法家在哪里都是天下无敌呢！</span><br><span class="redseed">【Ｅ】毕竟这个游戏中其实不存在〔防拳〕的道具，他们可以简单地撕裂你〔全系防御〕的高级装备。</span><br><span class="blueseed">【Ｐ】而且拳头直接拿殴系熟练度以及基础攻击力的数值做公式计算，可以打出更为稳定可观的伤害。</span><br><span class="blueseed">【Ｐ】所以下次回来的时候，不妨练练拳头吧？</span><br></div>',
	21 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个紧握钝器的身影，在你失神的瞳孔中逐渐淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】不知道你是不是被钉棍棒打死的呢？</span><br><span class="blueseed">【Ｐ】毕竟这玩意可是原版大逃杀中的名物之一。</span><br><span class="redseed">【Ｅ】总之，给棍棒打钉子后，能打出相当可观的伤害。</span><br><span class="blueseed">【Ｐ】此外，如果殴系武器上有〔电击〕属性，更能打出额外的加成。</span><br><span class="redseed">【Ｅ】下次回来的时候想发展殴系的话，就去找电击属性的殴系武器吧，『FARGO前基地』似乎有不错的。</span><br></div>',
	22 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个腰佩刀剑的身影，在你失神的瞳孔中逐渐淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】这是被斩杀了呢。</span><br><span class="blueseed">【Ｐ】斩系有稳定的「磨刀石」强化手段，并且很容易让对手受伤。但伤害浮动巨大，也很吃武器耐久。</span><br><span class="redseed">【Ｅ】而且，〔带毒〕的斩系属性更会打出额外的伤害。</span><br><span class="blueseed">【Ｐ】所以，想玩斩系的话，不妨开局去『精灵中心』弄点针筒，和毒药合成毒针吧。</span><br><span class="redseed">【Ｅ】而且毒针可以进一步通过合成强化，不会亏的；此外，毒性，「黑衣组织」，嗯……</span><br></div>',
	23 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个扛着枪械的身影，在你失神的瞳孔中逐渐淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】砰！午时已到！</span><br><span class="redseed">【Ｅ】射系的射程自然是最高的，不管是攻击还是压制都十分出色。</span><br><span class="blueseed">【Ｐ】如果说弱点的话，那就是要根据枪械类型使用不同的子弹，并且子弹打光就不好用了。</span><br><span class="blueseed">【Ｐ】想玩射系的话，就记好了：火焰和冰冻需要「压缩气罐」，而电击和音波需要「枪械电池」，连击的机枪自然需要「机枪子弹」！</span><br></div>',
	24 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个手持投掷武器的身影，在你失神的瞳孔中逐渐淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】暴扣！</span><br><span class="blueseed">【Ｐ】虽然投系的伤害成长比较低，命中率可是最高的呢。</span><br><span class="redseed">【Ｅ】投系每次攻击会消耗武器耐久，但是大部分投系武器都是无限耐久的。</span><br><span class="blueseed">【Ｐ】只要你抡圆胳膊，投掷武器的也是能扔很远。虽然没有子弹距离长，但是足够对付那些近战武器了。</span><br><span class="redseed">【Ｅ】想试试投系吗？去找一找小黄的服装，尝试合成精灵球吧。</span><br></div>',
	25 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个手持爆炸物的身影，在你失神的瞳孔中逐渐淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】被伏击了吗？即使你的武器再强，面对突然袭击也无能为力呀。<br><span class="blueseed">【Ｐ】爆系最招牌的就是发动敌人无法反击伏击和高额的爆炸伤害。</span><br><span class="redseed">【Ｅ】即使伏击很强，炸药包和绊雷也无法反击敌人呢。</span><br><span class="blueseed">【Ｐ】打算玩爆系的，就去找一找轻油和肥料吧。这俩合成的火药，可是爆系的精髓呢。</span><br></div>',
	26 => '“这味道……不对！”<br>饥渴难耐的你才咬了一口手中的补给品，就觉得不对劲。<br>然而，你发现得太晚了……<br>剧毒在几秒钟之内就夺去了你的生命。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】喂喂喂，不是所有东西都是可以吃的呀。</span><br><span class="blueseed">【Ｐ】看上去不能吃的，比方说氯化氢，天然气，就赶快丢掉吧。</span><br><span class="redseed">【Ｅ】看上去能吃的，也有概率带毒，比如橘黄色的果酱，电子寿司。</span><br><span class="blueseed">【Ｐ】如果实在拿不准的话，水，杏仁豆腐，压缩饼干都是无毒的。</span><span class="redseed">【Ｅ】对了，某个社团也可以检查食物是否带毒哦。</span><br></div>',
	27 => '“什么！这里竟然……”<br>没能留意到陷阱的你，只能眼睁睁看着轰然启动的陷阱无情地撕碎你的身躯。<br>“啊啊……这是……哪个混蛋……”<br>你的双眼被鲜血永远地掩盖了。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】百密一疏啊。敌人，可不只会出现在眼前。时刻留意脚下，小心那些地雷和落穴。</span><br><span class="redseed">【Ｅ】试试防御姿态吧，提高防御值能有效降低陷阱伤害。</span><br><span class="blueseed">【Ｐ】另外，也有一些装备上带有「陷阱探测」，「陷阱迎击」等属性，它们能帮你抵御这些陷阱。</span><br><span class="redseed">【Ｅ】经常跟陷阱打交道的社团，往往更有经验呢，下次不妨试试选它吧。</span><br></div>',
	28 => '你被很奇怪的事情夺去了生命。<br>也许这跟一个名叫夜什么月的人有一星半点的关系。<br>具体情况请参见游戏状况。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】这是……死亡笔记！？</span><br><span class="redseed">【Ｅ】唔，这是极强力的道具呢，能在瞬间之内抹杀玩家，好像……■cF■n创始人身上也带着它。</span><br><span class="blueseed">【Ｐ】被笔记抹杀了，还是等待下一局吧。风水轮流转，说不定会时来运转呢！</span><br></div>',
	29 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个攥着符札的身影，在你失神的瞳孔中逐渐淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】Icicle Fall！现在谁是笨蛋了啊！</span><br><span class="blueseed">【Ｐ】虽然距离非常短，但是独特伤害机制使得灵系的部分伤害可以无视防御直接攻击到敌人。</span><br><span class="redseed">【Ｅ】灵系的缺点是在攻击时会发出灵气，容易暴露位置；造成伤害的同时还会消耗体力。</span><br><span class="blueseed">【Ｐ】spell card是灵系最常见的武器类型。守矢神社和商店都有合成符卡的基础素材：空白符卡。</span><br><span class="redseed">【Ｅ】尝试借助游戏帮助合成一些符卡吧！</span><br></div>',
	30 => '好奇心果然杀死猫啊……<br>你勉强支起破碎的身躯，<br>看着那个你刚才按下的带按钮的小盒子无奈地笑着。<br>这真是残酷的恶作剧啊。<br>你的意识逐渐模糊了……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】喔，这可是能毁坏幻境的大杀器啊，怎么能乱摁呢？</span><br><span class="redseed">【Ｅ】不管怎么样，按下这个按钮会引发一些不可预估的事情。按之前一定要三思！</span><br></div>',
	31 => '注射器里的药液才打进一半，你就觉得身体有异样。<br>“脖子……好痒……”<br>你疯狂地抠着脖子上的淋巴腺，<br>很快就倒在动脉破裂而流出的血泊中……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】啊喂，这种奇奇怪怪的药剂你也敢打吗，这可是自杀药啊！</span><br><span class="blueseed">【Ｐ】听说……好像有一个人……打完之后竟然没死呢。</span><br><span class="redseed">【Ｅ】当然，你要真的是为了自杀而打，就当我们没说吧。</span><br></div>',
	32 => '“就躲在这里，让那些人自相残杀去吧。”<br>你正打着自己的小算盘，却被一声怒喝打断了。<br>“来人，这里有个挂机党！”<br>你惊愕地看着不知从哪里冒出来的玩家们把你团团围住。<br>“浪费时间，快去死吧！”<br>之后的事情，就太猎奇了……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】挂机判定时长是30分钟，记得定时移动。</span><br></div>',
	33 => '“对不起、对不起！能让我迫降一下吗？”<br>勉强躲过弹幕的你，忽然听到头上传来这样焦急的道歉声。<br>少女的迫降……？莫非是指……<br>少女娇柔的话音让你放松了警惕。<br>还没等你反应过来，少女——以及她乘坐的、几十吨重的机体——便把你的整个世界压得粉碎……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】啊，这个组织「G」时常会出任务呢。</span><br><span class="redseed">【Ｅ】下次闹出动静来还是不要久留了吧。</span><br></div>',
	34 => '将手中的溶剂一饮而尽之后，你感到全身就像燃烧起来一样。<br>“没错，我需要的就是这种力量！”<br>然而，当你看到自己像奶油般融化了的手掌在地上扑腾的时候，你才发现这场豪赌押错了边。<br>“那么，你就燃烧殆尽吧。”在意识崩解前，传来了一个女声的叹息。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】从奇异的存在上提取出的药剂，自然带有不可想象的力量。</span><br><span class="blueseed">【Ｐ】喝下药水之前，确保自己已经考虑过后果。</span><br><span class="redseed">【Ｅ】谨记，力量需要代价，贪欲带来毁灭。</span><br></div>',
	35 => '在你失去意识之前，你仿佛听到了一个冰冷的声音。<br>“像你这样的Homo-Speculator……”<br>“……真是最差劲的个体了”<br>然后，你看着你的身体和意识在一道圣光中溶解了。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】有一些游荡着的危险存在……它们会根据你的rp判定弄死你……</span><br><span class="redseed">【Ｅ】rp……可以通过仪水镜来查看。</span><br><span class="blueseed">【Ｐ】这种地方，还是不要久留了吧……</span><br></div>',
	36 => '你徒劳地想挣脱丝带的束缚，<br>但是从丝带上传来的巨大压力，简简单单地将你一分两半。<br>真是杂鱼一样的死法……<br><br><div class="seedhint">………………<br>…………<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】是键……？</span><br><span class="redseed">【Ｅ】被腰斩了啊。</span><br><span class="blueseed">【Ｐ】当你rp过高的时候，会被腰斩。为何不尝试一下触发陷阱来减少RP呢？</span><br><span class="redseed">【Ｅ】想去【雏菊之丘】的话，最好多踩几个地雷呢。</span><br></div>',
	37 => '你徒劳地想躲避丝带，<br>但是说时迟那时快，你发现你的头正在骨碌碌地往山脚下滚去。<br>真是杂鱼一样的死法……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】被键救济了呢。</span><br><span class="redseed">【Ｅ】键的救济跟rp相关。它是游戏里一个隐藏变量，正式名称为「报应点数」（Retribution Point）。</span><br><span class="blueseed">【Ｐ】减少rp的办法？可以尝试合成【风祭河水】饮用。</span><br><span class="blueseed">【Ｐ】注意，虽然风祭河水能有概率清空rp，但是会有极小的概率被键救济！</span><br></div>',
	38 => '你成功地躲避了丝带，<br>没想到从丝带中竟然喷出了岩浆！<br>你的意识在烈火中消失了。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】……键？</span><br><span class="blueseed">【Ｐ】唔，被救济了呢。</span><br><span class="redseed">【Ｅ】救济的判定跟你的rp相关，rp主要通过击杀NPC来积累，遭遇一些事件也会增加rp。</span><br><span class="blueseed">【Ｐ】出现事件后还是离远点吧。</span><br></div>',
	39 => '“去死吧！就算你是权限[哔]也挡不住我这一击的！”<br>你狂笑着使出你自认为决定胜负的一击，噗通倒下的却是你自己。<br>“不，这不科学！”被武器背叛的你遁入了无尽的黑暗中。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】越是强大的武器，越是有使用的风险。</span><br><span class="redseed">【Ｅ】越是浓厚的杀意，会带来越大的反噬。</span><br><span class="blueseed">【Ｐ】幻境自有其制衡之道，逾矩会带来无法想象的后果。</span><br><span class="redseed">【Ｅ】帮助上只说会必杀，可没说杀的是哪一方哦。</span><br></div>',
	40 => '“看起来好像没什么反应嘛……那是！！”<br>天空中突然降下的巨大柱状物瞬间将你的世界吞没。<br>你眼前一黑，便失去了意识。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】是那位神灵啊，干嘛要招惹她呢？</span><br><span class="blueseed">【Ｐ】使用她的符卡，后果自负哟。</span><br></div>',
	42 => '你摁下了手中的玩具般的按钮。<br>面前凭空出现了一扇闪光的门扉！<br>你毅然决然地踏了进去……<br>………………<br>…………<br>……<br>随着你独自摘下了VR设备站起身来，你松了一口气。<br>虽然其他的玩家还在这场游戏中冒死厮杀，但起码你自己毫发无伤地逃出了生天。<br>虽然这怎么说都无法让你成为胜利者，但就这一点本身，已经算是不错的成就了。<br>你回头看了一眼正显示着你所谓的死亡信息的屏幕，不禁笑了起来……<br><br>＝＝＝＝＝＝＝＝＝<br><span class="lime">独自逃脱成功！<br>你获得了20积分奖励！胜场+1！</span><br>＝＝＝＝＝＝＝＝＝<br>',
);

$syschatinfo = Array(
	'hack' => Array(
		Array('r0','红暮','哼，真有两下子……等下次禁区自动恢复好了。'),
		Array('r0','红暮','大胆狂徒，再敢这样做小心我直接改你的RP值。'),
		Array('r0','红暮','满是雪花的屏幕还真让人心烦。'),
		Array('r0','红暮','禁区失效了。如果是冲我而来，那么我奉陪。'),
		Array('b0','蓝凝','禁区被解除了？……'),
		Array('b0','蓝凝','似乎可以从显示屏上看出弹幕来……'),
		Array('b0','蓝凝','咦？不是吧！我不过洒了点水在控制台上而已……'),
	),
	'rdown' => Array(
		Array('b0','蓝凝','刚才那声音是……难道？'),
		Array('b0','蓝凝','...Engage, Rage mode-魔法特工 苍蓝☆乱舞！'),
	),
	'bdown' => Array(
		Array('r0','红暮','你们对我妹妹做了什么！？'),
		Array('r0','红暮','凝酱……是嘛，看来有碍事的家伙出现了。'),
	),
	'areawarn20' => Array(
		Array('r0','红暮','咳咳，那么下面播报禁区警告——'),
		Array('r0','红暮','真有趣，如果不提示，会有多少人阴沟里翻船呢？'),
		Array('r0','红暮','广播系统好像有点失灵？拖个人来修一下吧。'),
		Array('b0','蓝凝','这里是……警报。'),
		Array('b0','蓝凝','NOW THE ALARM.'),
	),
	'areawarn40' => Array(
		Array('r0','红暮','白热化！连斗阶段真是美丽啊。'),
		Array('r0','红暮','再过不久就要决出胜者了呢。'),
		Array('r0','红暮','似乎还留着几个重要地点，真遗憾。'),
		Array('r0','红暮','那边的职人，对就是你们几个，没死的话过来帮忙把这个陷阱挪走。'),
		Array('b0','蓝凝','……差点忘了……'),
		Array('b0','蓝凝','啊～真无聊……呃，在、在播报啊，现在是警报时间——'),
		Array('r1b0','蓝凝','那家伙撤退了，我得加油……'),
	),
	'areaadd20' => Array(
		Array('r0','红暮','听啊，那丧钟为谁而鸣？'),
		Array('r0','红暮','现在增加禁区。'),
		Array('r0','红暮','各位好，这里是红杀频道，我们先来看看本期的禁区死亡名单——'),
		Array('r0b0','红暮','就这几个人么……凝酱，你怎么看？'),
		Array('b0','蓝凝','禁区时间到！'),
		Array('b0','蓝凝','好像只要揿按钮就可以了。'),
		Array('b0','蓝凝','GENOCIDE IS COMING.'),
	),
	'areaadd40' => Array(
		Array('r0','红暮','现在死掉就没法投币了哦！'),
		Array('r0','红暮','正在奋战的各位辛苦了，下面给你们派发便当。'),
		Array('r0','红暮','各位好，现在战斗已经进入高潮，我们来看看这次的禁区死亡名单——'),
		Array('r0b1','红暮','就用你们的血为凝酱报仇雪恨！'),
		Array('b0','蓝凝','DEVILRY IS COMING.'),
		Array('b0','蓝凝','按键无效啊，那么看我的720度回旋斜踢电器维修法！咣——'),
		Array('r1b0','蓝凝','不会让那家伙失望的……'),
	),
	'end1' => Array(
		Array('r0b0','红暮','没有结果呢。凝酱，准备『下一轮』吧。'),
		Array('r0b0','红暮','预想之中。那么，凝酱，我们从这里撤离吧。'),
		Array('b0','蓝凝','这局真无聊啊。'),
		Array('r1b0','红暮','看来我死得毫无价值呢。凝酱，准备『下一轮』吧。'),
		Array('r1','红暮','看来我死得毫无价值呢。那么，你们就永远留在这里吧。'),
		Array('b1','蓝凝','……真遗憾呢。'),
	),
	'end2' => Array(
		Array('r0','红暮','决出胜负了。欢迎来到胜者的世界。'),
		Array('r0','红暮','竟然是你……不，并没有别的意思。祝贺你，获胜者。'),
		Array('b0','蓝凝','正统派的结局么……'),
		Array('r1','红暮','于是似乎碰到了不按牌理出牌的家伙呢。'),
		Array('b1','蓝凝','...'),
	),
	'end3' => Array(
		Array('r0','红暮','咦，我还活着？这不科学！'),
		Array('r1','红暮','哼……竟然遇到愚蠢到出手反抗的家伙了啊。'),
		Array('r1','红暮','你觉得你真的能逃脱么？'),
		Array('r1','红暮','那就让你达成所谓的HAPPY ENDING吧，呵呵呵……'),
		Array('r1b1','红暮','看来还真是心狠手辣的家伙，我会记住的。'),
		Array('r1b1','红暮','看来还真是心狠手辣的家伙，我会记住的。'),
		Array('b0','蓝凝','正统派的结局么……'),
		
		Array('b1','蓝凝','...'),
	),
);

/*Infomations*/
$_INFO = Array(
	'reg_success' => '注册成功！请返回首页登陆游戏。',
	'pass_success' => '修改密码成功。',
	'pass_failure' => '未修改密码。',
	'data_success' => '接受对帐户资料的修改。',
	'data_failure' => '未修改帐户资料。',
	'credits_conflicts' => '转换冲突，请勿同时转换不同类型积分。',
	'credits_success' => '积分转换成功。',
	'credits_failure' => '积分转换失败，请检查输入。',
	'credits_failure2' => '积分转换失败，请勿输入过大的数字。',
	'credits_failure3' => '积分转换失败，转换战斗力时请输入100的倍数。',
);

/*Error settings*/
$_ERROR = Array(
	'db_failure' => '数据库读写异常，请重试或通知管理员',
	'name_not_set' => '用户名不能为空，请检查用户名输入',
	'name_too_long' => '用户名过长，请检查用户名输入',
	'name_invalid' => '用户名含有非法字符，请检查用户名输入',
	'name_banned' => '用户名含有违禁用语，请检查用户名输入',
	'name_exists' => '用户名已被注册，请更换用户名',
	'pass_not_set' => '密码不能为空，请检查密码输入',
	'pass_not_match' => '两次输入的密码不一致，请检查密码输入',
	'pass_too_short' => '密码过短，请检查密码输入',
	'pass_too_long' => '密码过长，请检查密码输入',
	'ip_banned' => '此IP已被封禁，请与管理员联系',
	'logged_in' => '用户已登录，请先退出登陆再注册',
	'user_not_exists' => '用户不存在，请检查用户名输入',
	
	'no_login' => '用户未登陆，请从首页登录后再试',
	'login_check' => '用户信息验证失败，请清空缓存后再试',
	'login_time' => '登录间隔时间过长，请重新登录后再试',
	'login_info' => '用户信息不正确，请清空缓存和Cookie后进入游戏',
	'player_limit' => '本局游戏参加人数已达上限，无法进入，请下局再来',
	'wrong_pw' => '用户名或密码错误，请检查输入',
	'player_exist' => '角色已经存在，请不要重复激活',
	'no_start' => '游戏尚未开始，请稍后再试',
	'valid_stop' => '本游戏已经停止激活，无法进入，请下局再来',
	'user_ban' => '此账号禁止进入游戏，请与管理员联系',
	'no_admin' => '你不是管理员，不能使用此功能',
	'ip_limit' => '本局此IP激活人数已满，请下局再来',
	'no_power' => '你的管理权限不够，不能进行此操作',
	'wrong_adcmd' => '指令错误，请重新输入',
	//'invalid_name' => '用户名含有非法字符，请重新输入',
	//'banned_name' => '用户名含有违禁用语，请更改用户名',
	//'banned_ip' => '此IP已被封禁，请与管理员联系',
	//'long_name' => '用户名过长，请重新输入用户名'
);

?>
